/*
 * Создано в SharpDevelop.
 * Пользователь: Somov Studio
 * Дата: 06.05.2017
 * Время: 12:27
 * 
 * Для изменения этого шаблона используйте меню "Инструменты | Параметры | Кодирование | Стандартные заголовки".
 */
using System;
using System.IO;
using System.Net;
using System.Windows.Forms;
using ADOX;
using EnglishTrainer.Database.Local;
using EnglishTrainer.Data;

namespace EnglishTrainer.Database
{
	/// <summary>
	/// Description of CreateDatabaseMSAccess.
	/// </summary>
	public class CreateDatabaseMSAccess
	{
		Catalog ADOXCatalog;
		String fileName;
		String strConnection;
		
		public CreateDatabaseMSAccess(String baseFileName)
		{
			fileName = baseFileName;
		}
		
		public bool CreateDB()
		{
			Forms.FMain.progressLoad(5);
			
			strConnection = Config.oledbConnectString + fileName;
			
			ADOXCatalog = new Catalog();
			ADOXCatalog.Create(strConnection);
			if(File.Exists(fileName)){
				
				Forms.FMain.progressLoad(10);
				
				/* Создание таблиц */
				tablesPracticeAndTests();		// Практика
				Forms.FMain.progressLoad(5);
				tablePronouns();				// Местоимения: личные, притяжательные, возвратные, указательные, вопросительные, неопределенные
				Forms.FMain.progressLoad(10);
				tableVocabulary();				// Словарь
				Forms.FMain.progressLoad(40);
				tableIrregularVerbs();			// Неправильные глаголы
				Forms.FMain.progressLoad(45);
				tableRegularVerbs();			// Правильные глаголы
				Forms.FMain.progressLoad(50);
				tableModalVerbs();				// Модальные глаголы
				Forms.FMain.progressLoad(55);
				tableArticles();				// Артикли
				Forms.FMain.progressLoad(60);
				tableNouns();					// Существительное
				Forms.FMain.progressLoad(65);
				tableAdjective();				// Прилагательное
				Forms.FMain.progressLoad(70);
				tableNumeral();					// Числительное
				Forms.FMain.progressLoad(75);
				tableAdverb();					// Наречие
				Forms.FMain.progressLoad(80);
				tableConditions();				// Условное наклонение
				Forms.FMain.progressLoad(85);
				tablePreposition();				// Предлог
				Forms.FMain.progressLoad(90);
				tableUnion();					// Союзы
				Forms.FMain.progressLoad(95);
				tableParticles();				// Частицы
				Forms.FMain.progressLoad(96);
				tableModalWords();				// Модальные слова
				Forms.FMain.progressLoad(97);
				tableIntroductoryWords();		// Вводные слова
				Forms.FMain.progressLoad(98);
				tableInterjections();			// Междометия
				Forms.FMain.progressLoad(100);
				
				//Utilits.Console.Log("Базу данных " + Environment.NewLine + fileName + Environment.NewLine + " успешно создана!", false, true);
				return true;
			}else{
				Utilits.Console.LogError("Не удалось создать базу данных " + fileName, false, true);
				return false;
			}
		}
		
		
		/* =========================================================================================
		 * Создание таблиц в базе данных 
		 * =========================================================================================
		 */
		
		/* Таблица: Практика
		 * Поля:
		 * 01. ID - идентификатор
		 * 02. type - тип записи (folder/file)
		 * 03. name - наименование
		 * 03. parent - имя родительской папки
		 * 
		 * Таблица: Тесты
		 * Поля:
		 * 01. ID - идентификатор
		 * 02. IDPractice - идентификатор практики (внешний ключь)
		 * 03. condition - условие
		 * 04. question - вопрос
		 * 05. answer - правильный ответ на вопрос
		 * 06. hint - подсказка
		 */
		void tablesPracticeAndTests()
		{
			// таблица Practice
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			sqlCommand = "CREATE TABLE Practice (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[type] VARCHAR DEFAULT 'folder', " +
				"[name] VARCHAR DEFAULT '' UNIQUE, " +
				"[parent] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Practice.", false, true);
				Application.Exit();
			}
			
			string[][] data = new string[15][];
			data[0] = new string[3]{"folder","Общий курс английского", ""};
			data[1] = new string[3]{"file","Единственное и множественное число", "Общий курс английского"};
			data[2] = new string[3]{"file","Пренадлежность предметов", "Общий курс английского"};
			data[3] = new string[3]{"file","Личные местоимения", "Общий курс английского"};
			data[4] = new string[3]{"file","Простое настоящее время", "Общий курс английского"};
			data[5] = new string[3]{"file","Использование глагола to be", "Общий курс английского"};
			data[6] = new string[3]{"file","Использование предлогов вместо падежей", "Общий курс английского"};
			data[7] = new string[3]{"file","Использование предлогов", "Общий курс английского"};
			data[8] = new string[3]{"file","Использование прилагательных в степенях сравнения", "Общий курс английского"};
			data[9] = new string[3]{"file","Простое прошедшее время", "Общий курс английского"};
			data[10] = new string[3]{"file","Простое будущее время", "Общий курс английского"};
			data[11] = new string[3]{"file","Настоящее длительное время", "Общий курс английского"};
			data[12] = new string[3]{"file","Использование наречий", "Общий курс английского"};
			data[13] = new string[3]{"file","Модальные глаголы", "Общий курс английского"};
			data[14] = new string[3]{"file","Настоящее совершенное время", "Общий курс английского"};
			
			foreach(string[] values in data)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Practice (type, name, parent) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"', '"+values[2]+ "')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Practice.", false, true);
					Application.Exit();
				}
			}			
			query.Dispose();
			
			// таблица Tests
			query = new QueryOleDb(strConnection);
			sqlCommand = "CREATE TABLE Tests (" +
				"[ID] COUNTER, " +
				"[IDPractice] INT, " +
				"[condition] VARCHAR DEFAULT '', " +
				"[question] VARCHAR DEFAULT '', " +
				"[answer] VARCHAR DEFAULT '', " +
				"[hint] VARCHAR DEFAULT '', " +
				"PRIMARY KEY (ID), "+
				"FOREIGN KEY (IDPractice) REFERENCES Practice(ID) ON UPDATE CASCADE ON DELETE CASCADE" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Tests.", false, true);
				Application.Exit();
			}
			
			data = new string[201][];
			data[0] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Твой стол\"","Your table",""};
			data[1] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Твои столы\"","Your tables",""};
			data[2] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Твоя собака\"","Your dog",""};
			data[3] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Твои собаки\"","Your dogs",""};
			data[4] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Твой ботинок\"","Your shoe",""};
			data[5] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Твои ботинки\"","Your shoes",""};
			data[6] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Его ящик\"","His box",""};
			data[7] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Его ящики\"","His boxes",""};
			data[8] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Его бутылка\"","His bottle",""};
			data[9] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Его бутылки\"","His bottles",""};
			data[10] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Его бумуга\"","His paper",""};
			data[11] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Его бумаги\"","His papers",""};
			data[12] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Её Рука\"","Her hand",""};
			data[13] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Её руки\"","Her hands",""};
			data[14] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Её яблоко\"","Her apple",""};
			data[15] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Её яблоки\"","Her apples",""};
			data[16] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Её нога\"","Her leg",""};
			data[17] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Её ноги\"","Her legs",""};
			data[18] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Наш доклад\"","Our report",""};
			data[19] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Наши доклады\"","Our reports",""};
			data[20] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Наша идея\"","Our idea",""};
			data[21] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Наши идеи\"","Our ideas",""};
			data[22] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Наша ручка\"","Our pen",""};
			data[23] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Наши ручки\"","Our pens",""};
			data[24] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Их стул\"","Their chair",""};
			data[25] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Их стулья\"","Their chairs",""};
			data[26] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Их птица\"","Their bird",""};
			data[27] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Их птицы\"","Their birds",""};
			data[28] = new string[5]{"2","Используйте существительное в единственном числе","Переведите текст: \"Их тарелка\"","Their plate",""};
			data[29] = new string[5]{"2","Используйте существительное в множественном числе","Переведите текст: \"Их тарелки\"","Their plates",""};
			
			data[30] = new string[5]{"3","Используйте пренадлежность предмета","Переведите текст: \"Ты читаешь свою книгу\"","You read your book",""};
			data[31] = new string[5]{"3","Используйте пренадлежность предмета","Переведите текст: \"Он читает свою книгу\"","He reads his book",""};
			data[32] = new string[5]{"3","Используйте пренадлежность предмета","Переведите текст: \"Она читает свою книгу\"","She reads her book",""};
			data[33] = new string[5]{"3","Используйте пренадлежность предмета","Переведите текст: \"Мы читаем свои книги\"","We read our books",""};
			data[34] = new string[5]{"3","Используйте пренадлежность предмета","Переведите текст: \"Вы читаете свои книги\"","You read your books",""};
			data[35] = new string[5]{"3","Используйте пренадлежность предмета","Переведите текст: \"Они читают свои книги\"","They read their books",""};
			
			data[36] = new string[5]{"4","Используйте личные местоимения","Переведите текст: \"Я рассказываю ему об этом\"","I tell him about it",""};
			data[37] = new string[5]{"4","Используйте личные местоимения","Переведите текст: \"Ты рассказываешь мне об этом\"","You tell me about it",""};
			data[38] = new string[5]{"4","Используйте личные местоимения","Переведите текст: \"Он рассказывает ей об этом\"","He tells her about it",""};
			data[39] = new string[5]{"4","Используйте личные местоимения","Переведите текст: \"Она рассказывает нам об этом\"","She tells us about it",""};
			data[40] = new string[5]{"4","Используйте личные местоимения","Переведите текст: \"Мы рассказываем вам об этом\"","We tell you about it",""};
			data[41] = new string[5]{"4","Используйте личные местоимения","Переведите текст: \"Вы рассказываете им об этом\"","You tell them about it",""};
			data[42] = new string[5]{"4","Используйте личные местоимения","Переведите текст: \"Они рассказывают тебе об этом\"","They tell you about it",""};
			data[43] = new string[5]{"4","Используйте личные местоимения","Переведите текст: \"Я думаю о тебе\"","I think about you",""};
			data[44] = new string[5]{"4","Используйте личные местоимения","Переведите текст: \"Ты любишь её\"","You love her",""};
			
			data[45] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Мои друзья живут в Англии\"","My friends live in England",""};
			data[46] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Я хожу в школу каждое утро\"","I go to school every morning",""};
			data[47] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Он учится в университете\"","He studies at the University",""};
			data[48] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Мы всегда плаваем вечером\"","We always swim in the evening",""};
			data[49] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Магазины закрываются сегодня в 8 часов вечера\"","The shops close at eight tonight",""};
			data[50] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Они хотят сейчас уйти\"","They want to leave now",""};
			data[51] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Мы гуляем в саду\"","We walk in the garden",""};
			data[52] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Маленький мальчик сидит на стуле\""," A little boy sits on the chair",""};
			data[53] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Девочка из нашей школы видит злую собаку\"","A girl from our school sees an angry dog",""};
			data[54] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Летом они обычно спят снаружи (на открытом воздухе)\"","In the summer they usually sleep outside",""};
			data[55] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Моя кошка прыгает и мяукает\"","My cat jumps and mews",""};
			data[56] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Линда не говорит со мной\"","Linda doesn’t talk to me",""};
			data[57] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Они не хотят навестить своих друзей\"","They do not want to visit their friends",""};
			data[58] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Ты даёшь ему эту коробку?\"","Do you give him this box?",""};
			data[59] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Он поёт красивую песню?\"","Does he sing a nice song?",""};
			data[60] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Вы идёте сегодня вечером в кино?\"","Do you go to the cinema tonight?",""};
			data[61] = new string[5]{"5","Используйте простое настояще время","Переведите текст: \"Могу ли я вам помочь?\"","Can I help you?",""};
						
			data[62] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Он мальчик\"","He is a boy","He ... a boy"};
			data[63] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Я студент\"","I am a student","I ... a student"};
			data[64] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Мы здесь\"","We are here","We ... here"};
			data[65] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Она девочка\"","She is a girl","She ... a girl"};
			data[66] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Ты сильный\"","You are strong","You ... strong"};
			data[67] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Они англичане\"","They are Englishmen","They ... Englishmen"};
			data[68] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Он не мальчик\"","He is not a boy","He ... a boy"};
			data[69] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Я не студент\"","I am not a student","I ... a student"};
			data[70] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Мы не здесь\"","We are not here","We ... here"};
			data[71] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Она не девочка\"","She is not a girl","She ... a girl"};
			data[72] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Ты не сильный\"","You are not strong","You ... strong"};
			data[73] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Они не англичане\"","They are not Englishmen","They ... Englishmen"};
			data[74] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Макс, это Питер\"","Max, this is Peter","Max, this ... Peter"};
			data[75] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Как твоё имя?\"","What is your name?","What ... your name?"};
			data[76] = new string[5]{"6","Используйте глагол to be","Переведите текст: \"Моё имя Майк?\"","My name is Mike","My name ... Mike"};
			
			data[77] = new string[5]{"7","Используйте предлог для следующих словосочитаний","Переведите текст: \"Имена девочек\"","the girls’ names",""};
			data[78] = new string[5]{"7","Используйте предлог для следующих словосочитаний","Переведите текст: \"Новый городской центр\"","the city’s new centre",""};
			data[79] = new string[5]{"7","Используйте предлог для следующих словосочитаний","Переведите текст: \"Население мира\"","the world’s population",""};
			data[80] = new string[5]{"7","Используйте предлог для следующих словосочитаний","Переведите текст: \"Успех компании\"","the company’s success",""};
			data[81] = new string[5]{"7","Используйте предлог для следующих словосочитаний","Переведите текст: \"Гнёзда орлов\"","man’s dream",""};
			data[82] = new string[5]{"7","Используйте предлог для следующих словосочитаний","Переведите текст: \"Мечта мужчины\"","the girls’ names",""};
			data[83] = new string[5]{"7","Используйте предлог для следующих словосочитаний","Переведите текст: \"Имя девочки\"","the girl’s name",""};
			data[84] = new string[5]{"7","Используйте предлог для следующих словосочитаний","Переведите текст: \"Свадьба Тома и Сары\"","Tom’s and Sarah’s wedding",""};
			data[85] = new string[5]{"7","Используйте предлог для следующих словосочитаний","Переведите текст: \"Игрушки детей\"","the children’s toys",""};
			data[86] = new string[5]{"7","Используйте предлог для следующих словосочитаний","Переведите текст: \"Решение правительства\"","the government’s decision",""};
			data[87] = new string[5]{"7","Используйте предлог для следующих словосочитаний","Переведите текст: \"Корабль капитана\"","the ship’s captain",""};
			
			data[88] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Они думают обо мне\"","They think about me",""};
			data[89] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Облака плывут по небу\"","Clouds travel across the sky",""};
			data[90] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"После вас!\"","After you!",""};
			data[91] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Я ничего не имею против этого\"","I have nothing against it",""};
			data[92] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Среди римлян он великий человек\"","Among the Romans he is a great man",""};
			data[93] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Она переводчица ООН\"","She is a translator at the UN",""};
			data[94] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Сделайте это, пока не забыли\"","Do it before you forget",""};
			data[95] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Между тобой и мной (между нами)\"","Between you and me",""};
			data[96] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Я вижу по его глазам, что он боится\"","I know by his eyes that he is afraid",""};
			data[97] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Пожалуйста, сделай это для меня\"","Please do it for me!",""};			data[98] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Они думают обо мне\"","They think about me",""};
			data[99] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Она из хорошей семьи\"","She is from a good family",""};
			data[100] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Посмотрите в зеркало!\"","Look in the mirror!",""};
			data[101] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Машина съезжает с дороги\"","The car goes off the road",""};
			data[102] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Книга (находится) на столе\"","The book is on the table",""};
			data[103] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Собака прыгает (перепрыгивает) через лужи\"","The dog jumps over the puddles",""};
			data[104] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Я могу видеть их в тумане (сквозь туман)\"","I can see them through the fog",""};
			data[105] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Маленькая девочка ходит в школу\"","A little girl goes to school",""};
			data[106] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Наша кошка (находится) под диваном\"","Our cat is under the sofa",""};
			data[107] = new string[5]{"8","Используйте предлог для следующих словосочитаний","Переведите текст: \"Пойдёмте со мной!\"","Come with me!",""};
			
			data[108] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"Я сержусь на него\"","I am angry with him",""};
			data[109] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"Это очень плохо (некрасиво) с его стороны\"","It is too bad of him",""};
			data[110] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"Её руки синие от холода\"","Her hands are blue with cold",""};
			data[111] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"Мик очень смелый\"","Mick is very brave",""};
			data[112] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"Он осторожен в деньгах (Он не тратит денег зря)\"","He is careful with his money",""};
			data[113] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"Он умён в арифметике\"","He is clever at arithmetic",""};
			data[114] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"Верно это утверждение или нет?\"","Is this statement true or false?",""};
			data[115] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"Я рад с вами познакомиться\"","I am glad to meet you",""};
			data[116] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"Они большие друзья\"","They are great friends",""};
			data[117] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"Мне лень ему писать\"","I am too lazy to write to him",""};
			data[118] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"У них красивый (уютный) дом\"","They have a nice home",""};
			data[119] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"Это нормальная погода для этого времени года\"","It is normal weather for the time of year",""};
			data[120] = new string[5]{"9","Используйте прилагательные в степенях сравнения","Переведите текст: \"Положите деньги в надёжное место!\"","Put the money in a safe place!",""};
			
			data[121] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Он был из нашей компании\"","He was of our company",""};
			data[122] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Он начинал как репортёр\"","He began as a reporter",""};
			data[123] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Банк лопнул\"","The bank broke",""};
			data[124] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Мой друг построил дом\"","My friend built a house",""};
			data[125] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Она купила красивое платье\"","She bought a nice dress",""};
			data[126] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Я предпочёл остаться\"","I chose to remain",""};
			data[127] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Партия пришла к власти\"","The party came into power",""};
			data[128] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Как он сдал экзамены?\"","How did he do in his exams?",""};
			data[129] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Кошка пила молоко\"","The cat drank milk",""};
			data[130] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Мы подъехали прямо к двери\"","We drove up to the door",""};
			data[131] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Волосы падали ей на плечи\"","Her hair fell over her shoulders",""};
			data[132] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Мы чувствовали голод\"","We felt hungry",""};
			data[133] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Они летели над лесами\"","They flew over the forests",""};
			data[134] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Я получил вашу телеграмму\"","I got your telegram",""};
			data[135] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Я дал свой багаж носильщику\"","I gave the porter my luggage",""};
			data[136] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Он ушёл далеко\"","He went a long way",""};
			data[137] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Я никогда о таком не слышал\"","I never heard of such a thing",""};
			data[138] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Тучи спрятали солнце\"","Clouds hid the sun",""};
			data[139] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Он упал и поранил (ушиб) спину\"","He fell and hurt his back",""};
			data[140] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Ты сделал (приготовил) завтрак\"","You made breakfast",""};
			data[141] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Она встретила гостей в дверях\"","She met her guests at the door",""};
			data[142] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Они всегда платили наличными\"","They always paid cash",""};
			data[143] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Я побежал за ним\"","I ran after him",""};
			data[144] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Я перепродал ему машину за меньшие деньги, чем заплатил за неё\"","I sold the car back to him for less than I paid for it",""};
			data[145] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Она поплыла к берегу\"","She swam for the shore",""};
			data[146] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Он взял ручку и начал писать\"","He took his pen and began to write",""};
			data[147] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Я рассказал вам секрет\"","I told you a secret",""};
			data[148] = new string[5]{"10","Используйте простое прошедшее время для следующих словосочитаний","Переведите текст: \"Он понимал детей\"","He understood children",""};
			
			data[149] = new string[5]{"11","Используйте простое будущее время для следующих словосочитаний","Переведите текст: \"Я буду писать письмо\"","I will write a letter",""};
			data[150] = new string[5]{"11","Используйте простое будущее время для следующих словосочитаний","Переведите текст: \"Я пойду в кино\"","I will go to the cinema",""};
			data[151] = new string[5]{"11","Используйте простое будущее время для следующих словосочитаний","Переведите текст: \"Мы будем пить сок\"","We will drink juice",""};
			data[152] = new string[5]{"11","Используйте простое будущее время для следующих словосочитаний","Переведите текст: \"Он будет читать газету\"","He will read a newspaper",""};
			data[153] = new string[5]{"11","Используйте простое будущее время для следующих словосочитаний","Переведите текст: \"Они будут танцевать всю ночь\"","They will dance all night long",""};
			data[154] = new string[5]{"11","Используйте простое будущее время для следующих словосочитаний","Переведите текст: \"Том сегодня вечером пойдёт в библиотеку\"","Tom will go to the library this evening",""};
			data[155] = new string[5]{"11","Используйте простое будущее время для следующих словосочитаний","Переведите текст: \"Я встречу тебя в семь часов\"","I will meet you at seven o’clock",""};
			
			data[156] = new string[5]{"12","Используйте настоящее длительное время для следующих словосочитаний","Переведите текст: \"Я сейчас иду\"","I am going",""};
			data[157] = new string[5]{"12","Используйте настоящее длительное время для следующих словосочитаний","Переведите текст: \"Мы сейчас смотрим\"","We are watching",""};
			data[158] = new string[5]{"12","Используйте настоящее длительное время для следующих словосочитаний","Переведите текст: \"Он сейчас спит\"","He is sleeping",""};
			data[159] = new string[5]{"12","Используйте настоящее длительное время для следующих словосочитаний","Переведите текст: \"Я изучаю английский\"","I am studying English",""};
			data[160] = new string[5]{"12","Используйте настоящее длительное время для следующих словосочитаний","Переведите текст: \"Я звоню своей матери (сейчас, в данный момент)\"","I am calling my mother",""};
			data[161] = new string[5]{"12","Используйте настоящее длительное время для следующих словосочитаний","Переведите текст: \"Я встаю (сейчас)\"","I am getting up",""};
			data[162] = new string[5]{"12","Используйте настоящее длительное время для следующих словосочитаний","Переведите текст: \"Я работаю в офисе (в данный момент, именно сейчас)\"","I am working in office",""};
			data[163] = new string[5]{"12","Используйте настоящее длительное время для следующих словосочитаний","Переведите текст: \"Джим ест яблоки (сейчас)\"","Jim is eating apples",""};
			data[164] = new string[5]{"12","Используйте настоящее длительное время для следующих словосочитаний","Переведите текст: \"Она смотрит телевизор (сейчас)\"","She is watching TV",""};
			data[165] = new string[5]{"12","Используйте настоящее длительное время для следующих словосочитаний","Переведите текст: \"Дети играют в парке (сейчас)\"","The children are playing in the park",""};
			data[166] = new string[5]{"12","Используйте настоящее длительное время для следующих словосочитаний","Переведите текст: \"Они моют посуду (сейчас)\"","They are doing the dishes",""};
			data[167] = new string[5]{"12","Используйте настоящее длительное время для следующих словосочитаний","Переведите текст: \"Они читают книги (сейчас)\"","They are reading books",""};
			
			data[168] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Этот ребёнок всегда плачет\"","This child is always crying",""};
			data[169] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Здесь есть где-нибудь аптека?\"","Is there a chemist’s anywhere?",""};
			data[170] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Он опять вернулся\"","He is back again",""};
			data[171] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Cолнце село\"","The sun is down",""};
			data[172] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Вы знаете это довольно хорошо\"","You know well enough",""};
			data[173] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Вы его когда-нибудь видите?\"","Do you ever see him?",""};
			data[174] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Едва ли я его знаю\"","I hardly know him",""};
			data[175] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Вот и я! (Я тут!)\"","Here I am!",""};
			data[176] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Я открыл коробку – внутри ничего не было\"","I opened the box and there was nothing inside",""};
			data[177] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Исправиться никогда не поздно\"","It is never too late to mend",""};
			data[178] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Ему некуда идти\"","He has nowhere to go",""};
			data[179] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Он всё ещё (до сих пор) не понимает\"","He still doesn’t understand",""};
			data[180] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Чего же вы тогда (в таком случае) хотите?\"","Then what do you want?",""};
			data[181] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Я чувствую себя не очень хорошо\"","I don’t feel very well",""};
			data[182] = new string[5]{"13","Используйте наречие для следующих словосочитаний","Переведите текст: \"Можно уже войти?\"","Сan I come in yet?",""};
			
			data[183] = new string[5]{"14","Используйте модальные глаголы для следующих словосочитаний","Переведите текст: \"Я могу понять это\"","I can understand that",""};
			data[184] = new string[5]{"14","Используйте модальные глаголы для следующих словосочитаний","Переведите текст: \"Если хотите, можете идти\"","You may go if you wish",""};
			data[185] = new string[5]{"14","Используйте модальные глаголы для следующих словосочитаний","Переведите текст: \"Я должен (вынужден) попросить вас уйти\"","I must ask you to leave",""};
			data[186] = new string[5]{"14","Используйте модальные глаголы для следующих словосочитаний","Переведите текст: \"Вы должны ему сказать (Вам следует ему сказать)\"","You should tell him",""};
			data[187] = new string[5]{"14","Используйте модальные глаголы для следующих словосочитаний","Переведите текст: \"Вам не обязательно закончить всю работу завтра\"","You needn’t do it all tomorrow",""};
			
			data[188] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Он приехал издалека\"","He has come a hundred miles",""};
			data[189] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Я покончил с алгеброй\"","I have done with algebra",""};
			data[190] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Вы узнали расписание поездов?\"","Have you found out about the trains?",""};
			data[191] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Мы украсили дом\"","We have decorated the house",""};
			data[192] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Его интерес к литературе исчез (У него пропал интерес к литературе)\"","His interest in literature has gone",""};
			data[193] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Вы слышали новости?\"","Have you heard the news?",""};
			data[194] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Мы с вами не знакомы?\"","Haven’t we met before?",""};
			data[195] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Я расплатился со своими долгами\"","I have paid off my debts",""};
			data[196] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Вы прочитали его письмо до конца?\"","Have you read his letter through?",""};
			data[197] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Я снял квартиру в городе\"","I have taken a flat in town",""};
			data[198] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Он видел жизнь\"","He has seen life",""};
			data[199] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Я пришёл рано\"","I have arrived early",""};
			data[200] = new string[5]{"15","Используйте настоящее совершенное время для следующих словосочитаний","Переведите текст: \"Они написали письмо?\"","Have they written a letter?",""};
		
			foreach(string[] values in data)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Tests (IDPractice, condition, question, answer, hint) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"', '"+values[2]+"', '"+values[3]+"', '"+values[4]+ "')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Tests.", false, true);
					Application.Exit();
				}
			}
			query.Dispose();
		}
		
		
		/* Таблица: Словарь
		 * Поля:
		 * 01. ID - идентификатор
		 * 02. English_Word - английское слово
		 * 03. Rus_Translation - перевод на русский язык
		 */
		void tableVocabulary()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE EngRusVocabulary (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[English_Word] VARCHAR DEFAULT '' UNIQUE, " +
				"[Rus_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы EngRusVocabulary.", false, true);
				Application.Exit();
			}
			
			string[][] words = new string[1117][];
			words[0] = new string[2]{"A",""};
			words[1] = new string[2]{"able","способный"};
			words[2] = new string[2]{"about","о"};
			words[3] = new string[2]{"account","счёт"};
			words[4] = new string[2]{"acid","кислый"};
			words[5] = new string[2]{"across","через"};
			words[6] = new string[2]{"act","поступок"};
			words[7] = new string[2]{"actor","актёр"};
			words[8] = new string[2]{"addition","добавление"};
			words[9] = new string[2]{"adjustment","регулирование"};
			words[10] = new string[2]{"advertisement","реклама"};
			words[11] = new string[2]{"after","после"};
			words[12] = new string[2]{"again","опять"};
			words[13] = new string[2]{"against","против"};
			words[14] = new string[2]{"agreement","соглашение"};
			words[15] = new string[2]{"air","воздух"};
			words[16] = new string[2]{"Albania","Албания"};
			words[17] = new string[2]{"Albanian","албанец, албанский(язык)"};
			words[18] = new string[2]{"all","все"};
			words[19] = new string[2]{"almost","почти"};
			words[20] = new string[2]{"already","уже"};
			words[21] = new string[2]{"always","всегда"};
			words[22] = new string[2]{"American","американец, американский"};
			words[23] = new string[2]{"among","среди"};
			words[24] = new string[2]{"amount","величина"};
			words[25] = new string[2]{"amusement","развлечение"};
			words[26] = new string[2]{"and","и, а"};
			words[27] = new string[2]{"angle","угол"};
			words[28] = new string[2]{"angry","сердитый"};
			words[29] = new string[2]{"animal","животное"};
			words[30] = new string[2]{"answer","ответ"};
			words[31] = new string[2]{"ant","муравей"};
			words[32] = new string[2]{"any","кто-нибудь, что-нибудь"};
			words[33] = new string[2]{"anyway","где-нибудь"};
			words[34] = new string[2]{"anywhere","где-нибудь, куда-нибудь"};
			words[35] = new string[2]{"apparatus","аппарат, прибор"};
			words[36] = new string[2]{"apple","яблоко"};
			words[37] = new string[2]{"approval","одобрение"};
			words[38] = new string[2]{"April","апрель"};
			words[39] = new string[2]{"arch","арка"};
			words[40] = new string[2]{"argument","аргумент"};
			words[41] = new string[2]{"arm","рука"};
			words[42] = new string[2]{"army","армия"};
			words[43] = new string[2]{"art","искусство"};
			words[44] = new string[2]{"as","как"};
			words[45] = new string[2]{"at","при, в, на"};
			words[46] = new string[2]{"attack","нападение"};
			words[47] = new string[2]{"attempt","попытка"};
			words[48] = new string[2]{"attention","внимание"};
			words[49] = new string[2]{"attentively","внимательно"};
			words[50] = new string[2]{"attraction","притяжение"};
			words[51] = new string[2]{"August","август"};
			words[52] = new string[2]{"Austria","Австрия"};
			words[53] = new string[2]{"Austrian","австриец, австрийский"};
			words[54] = new string[2]{"authority","власть"};
			words[55] = new string[2]{"automatic","автоматический"};
			words[56] = new string[2]{"awake","бодрствующий"};
			words[57] = new string[2]{"B",""};
			words[58] = new string[2]{"baby","ребёнок"};
			words[59] = new string[2]{"back","назад, обратно; спина"};
			words[60] = new string[2]{"bad","плохой"};
			words[61] = new string[2]{"bag","сумка"};
			words[62] = new string[2]{"balance","равновесие"};
			words[63] = new string[2]{"ball","мяч"};
			words[64] = new string[2]{"band","лента; группа"};
			words[65] = new string[2]{"bar","бар"};
			words[66] = new string[2]{"base","основа"};
			words[67] = new string[2]{"basin","таз"};
			words[68] = new string[2]{"basket","корзина"};
			words[69] = new string[2]{"bath","ванна"};
			words[70] = new string[2]{"be","быть, находиться"};
			words[71] = new string[2]{"beautiful","красивый"};
			words[72] = new string[2]{"because","потому что"};
			words[73] = new string[2]{"become","становиться"};
			words[74] = new string[2]{"bed","кровать"};
			words[75] = new string[2]{"bee","пчела"};
			words[76] = new string[2]{"before","до, раньше, прежде"};
			words[77] = new string[2]{"begin","начинать"};
			words[78] = new string[2]{"behaviour","поведение"};
			words[79] = new string[2]{"Belgian","бельгиец, бельгийский"};
			words[80] = new string[2]{"Belgium","Бельгия"};
			words[81] = new string[2]{"belief","вера"};
			words[82] = new string[2]{"bell","колокольчик"};
			words[83] = new string[2]{"bent","нечестный"};
			words[84] = new string[2]{"berry","ягода"};
			words[85] = new string[2]{"between","между"};
			words[86] = new string[2]{"big","большой"};
			words[87] = new string[2]{"bird","птица"};
			words[88] = new string[2]{"birth","рождение"};
			words[89] = new string[2]{"bit","кусок"};
			words[90] = new string[2]{"bite","кусать"};
			words[91] = new string[2]{"bitter","горький"};
			words[92] = new string[2]{"black","чёрный"};
			words[93] = new string[2]{"blade","лезвие"};
			words[94] = new string[2]{"blood","кровь"};
			words[95] = new string[2]{"blow","дуть"};
			words[96] = new string[2]{"blue","синий"};
			words[97] = new string[2]{"board","доска"};
			words[98] = new string[2]{"boat","лодка"};
			words[99] = new string[2]{"body","тело"};
			words[100] = new string[2]{"boiling","кипящий"};
			words[101] = new string[2]{"bone","кость"};
			words[102] = new string[2]{"book","книга"};
			words[103] = new string[2]{"boot","ботинок"};
			words[104] = new string[2]{"bottle","бутылка"};
			words[105] = new string[2]{"box","ящик, коробка"};
			words[106] = new string[2]{"boy","мальчик"};
			words[107] = new string[2]{"brain","мозг"};
			words[108] = new string[2]{"brake","тормоз"};
			words[109] = new string[2]{"branch","ветвь"};
			words[110] = new string[2]{"brass","медь, латунь"};
			words[111] = new string[2]{"brave","смелый"};
			words[112] = new string[2]{"Brazil","Бразилия"};
			words[113] = new string[2]{"Brazilian","бразилец, бразильский"};
			words[114] = new string[2]{"bread","хлеб"};
			words[115] = new string[2]{"break","ломать"};
			words[116] = new string[2]{"breath","дыхание"};
			words[117] = new string[2]{"brick","кирпич"};
			words[118] = new string[2]{"bridge","мост"};
			words[119] = new string[2]{"bright","светлый"};
			words[120] = new string[2]{"bring","приносить"};
			words[121] = new string[2]{"broken","сломанный"};
			words[122] = new string[2]{"brother","брат"};
			words[123] = new string[2]{"brown","коричневый"};
			words[124] = new string[2]{"brush","чистить"};
			words[125] = new string[2]{"bucket","ведро"};
			words[126] = new string[2]{"build","строить"};
			words[127] = new string[2]{"building","здание"};
			words[128] = new string[2]{"bulb","лампочка"};
			words[129] = new string[2]{"Bulgaria","Болгария"};
			words[130] = new string[2]{"Bulgarian","болгарин, болгарский (язык)"};
			words[131] = new string[2]{"burn","жечь"};
			words[132] = new string[2]{"burst","разрыв"};
			words[133] = new string[2]{"business","дело"};
			words[134] = new string[2]{"businessman","бизнесмен"};
			words[135] = new string[2]{"but","но"};
			words[136] = new string[2]{"butter","масло"};
			words[137] = new string[2]{"button","пуговица"};
			words[138] = new string[2]{"buy","покупать"};
			words[139] = new string[2]{"by","посредством; у, около"};
			words[140] = new string[2]{"byte","байт"};
			words[141] = new string[2]{"C",""};
			words[142] = new string[2]{"cake","пирожное"};
			words[143] = new string[2]{"calm","спокойный"};
			words[144] = new string[2]{"camera","фотоаппарат, фотокамера"};
			words[145] = new string[2]{"cameraman","оператор"};
			words[146] = new string[2]{"canvas","холст"};
			words[147] = new string[2]{"car","машина"};
			words[148] = new string[2]{"card","открытка"};
			words[149] = new string[2]{"care","заботиться"};
			words[150] = new string[2]{"careful","осторожный"};
			words[151] = new string[2]{"carriage","вагон"};
			words[152] = new string[2]{"cart","тележка"};
			words[153] = new string[2]{"cat","кошка"};
			words[154] = new string[2]{"cause","причинять"};
			words[155] = new string[2]{"cede","уступать"};
			words[156] = new string[2]{"cent","цент"};
			words[157] = new string[2]{"certain","несомненный"};
			words[158] = new string[2]{"chain","цепь"};
			words[159] = new string[2]{"chalk","мел"};
			words[160] = new string[2]{"chance","случай"};
			words[161] = new string[2]{"change","менять"};
			words[162] = new string[2]{"cheap","дешёвый"};
			words[163] = new string[2]{"check","чек"};
			words[164] = new string[2]{"cheese","сыр"};
			words[165] = new string[2]{"chemical","химический"};
			words[166] = new string[2]{"chest","сундук"};
			words[167] = new string[2]{"chief","главный"};
			words[168] = new string[2]{"chin","подбородок"};
			words[169] = new string[2]{"China","Китай"};
			words[170] = new string[2]{"Chinese","китаец, китайский (язык)"};
			words[171] = new string[2]{"chocolate","шоколад"};
			words[172] = new string[2]{"choose","выбирать"};
			words[173] = new string[2]{"church","церковь"};
			words[174] = new string[2]{"circle","круг"};
			words[175] = new string[2]{"clean","чистый"};
			words[176] = new string[2]{"clear","ясный"};
			words[177] = new string[2]{"clever","умный"};
			words[178] = new string[2]{"clock","часы (настенные)"};
			words[179] = new string[2]{"clothes","одежда"};
			words[180] = new string[2]{"cloud","облако"};
			words[181] = new string[2]{"clumsy","неуклюжий"};
			words[182] = new string[2]{"coal","уголь"};
			words[183] = new string[2]{"coat","пальто"};
			words[184] = new string[2]{"coffee","кофе"};
			words[185] = new string[2]{"cold","холодный"};
			words[186] = new string[2]{"collar","воротник"};
			words[187] = new string[2]{"comb","расчёска"};
			words[188] = new string[2]{"come","приходить"};
			words[189] = new string[2]{"comfort","комфорт"};
			words[190] = new string[2]{"committee","комитет"};
			words[191] = new string[2]{"common","общий"};
			words[192] = new string[2]{"company","компания"};
			words[193] = new string[2]{"comparison","сравнение"};
			words[194] = new string[2]{"competition","соревнование"};
			words[195] = new string[2]{"complete","полный"};
			words[196] = new string[2]{"complex","сложный"};
			words[197] = new string[2]{"condition","состояние"};
			words[198] = new string[2]{"connection","соединение"};
			words[199] = new string[2]{"conscious","сознающий"};
			words[200] = new string[2]{"control","контроль"};
			words[201] = new string[2]{"cook","готовить"};
			words[202] = new string[2]{"copper","медь"};
			words[203] = new string[2]{"copy","копировать"};
			words[204] = new string[2]{"cord","верёвка"};
			words[205] = new string[2]{"cotton","хлопок"};
			words[206] = new string[2]{"cough","кашель"};
			words[207] = new string[2]{"country","страна"};
			words[208] = new string[2]{"cover","покрывать"};
			words[209] = new string[2]{"cow","корова"};
			words[210] = new string[2]{"cowardly","трусливый"};
			words[211] = new string[2]{"crack","взламывать"};
			words[212] = new string[2]{"credit","доверие"};
			words[213] = new string[2]{"crime","преступление"};
			words[214] = new string[2]{"cruel","жестокий"};
			words[215] = new string[2]{"crush","давка"};
			words[216] = new string[2]{"cry","кричать; плакать"};
			words[217] = new string[2]{"cup","чашка"};
			words[218] = new string[2]{"current","поток"};
			words[219] = new string[2]{"curtain","штора"};
			words[220] = new string[2]{"curve","сгибать"};
			words[221] = new string[2]{"cushion","диванная подушка"};
			words[222] = new string[2]{"cut","резать"};
			words[223] = new string[2]{"D",""};
			words[224] = new string[2]{"damage","повреждать"};
			words[225] = new string[2]{"danger","опасность"};
			words[226] = new string[2]{"Danish","датчанин, датский (язык)"};
			words[227] = new string[2]{"dark","тёмный"};
			words[228] = new string[2]{"daughter","дочь"};
			words[229] = new string[2]{"day","день"};
			words[230] = new string[2]{"dead","мёртвый"};
			words[231] = new string[2]{"dear","дорогой"};
			words[232] = new string[2]{"death","смерть"};
			words[233] = new string[2]{"debt","долг"};
			words[234] = new string[2]{"December","декабрь"};
			words[235] = new string[2]{"decision","решение"};
			words[236] = new string[2]{"deep","глубокий"};
			words[237] = new string[2]{"degree","степень"};
			words[238] = new string[2]{"delicate","изящный"};
			words[239] = new string[2]{"Denmark","Дания"};
			words[240] = new string[2]{"dependent","зависимый"};
			words[241] = new string[2]{"design","план"};
			words[242] = new string[2]{"desire","желание"};
			words[243] = new string[2]{"destruction","разрушение"};
			words[244] = new string[2]{"detail","деталь"};
			words[245] = new string[2]{"development","развитие"};
			words[246] = new string[2]{"different","другой"};
			words[247] = new string[2]{"digestion","пищеварение"};
			words[248] = new string[2]{"diligent","трудолюбивый"};
			words[249] = new string[2]{"direction","направление"};
			words[250] = new string[2]{"dirty","грязный"};
			words[251] = new string[2]{"discovery","открытие"};
			words[252] = new string[2]{"discussion","обсуждение"};
			words[253] = new string[2]{"disease","болезнь"};
			words[254] = new string[2]{"disgust","отвращение"};
			words[255] = new string[2]{"distance","расстояние"};
			words[256] = new string[2]{"distinctly","отчётливо"};
			words[257] = new string[2]{"distribution","распределение"};
			words[258] = new string[2]{"division","деление"};
			words[259] = new string[2]{"do","делать"};
			words[260] = new string[2]{"doctor","врач"};
			words[261] = new string[2]{"dog","собака"};
			words[262] = new string[2]{"door","дверь"};
			words[263] = new string[2]{"doubt","сомнение"};
			words[264] = new string[2]{"down","внизу, вниз"};
			words[265] = new string[2]{"drain","водосток"};
			words[266] = new string[2]{"draw","рисовать"};
			words[267] = new string[2]{"drawer","ящик"};
			words[268] = new string[2]{"dress","платье"};
			words[269] = new string[2]{"drink","пить"};
			words[270] = new string[2]{"drive","вести машину"};
			words[271] = new string[2]{"driver","водитель"};
			words[272] = new string[2]{"drop","капля"};
			words[273] = new string[2]{"dry","сухой"};
			words[274] = new string[2]{"due","должное"};
			words[275] = new string[2]{"dust","пыль"};
			words[276] = new string[2]{"Dutch","голландец, голландский (язык)"};
			words[277] = new string[2]{"E",""};
			words[278] = new string[2]{"ear","ухо"};
			words[279] = new string[2]{"early","ранний"};
			words[280] = new string[2]{"earth","земля"};
			words[281] = new string[2]{"east","восток"};
			words[282] = new string[2]{"eat","есть"};
			words[283] = new string[2]{"edge","край"};
			words[284] = new string[2]{"education","образование"};
			words[285] = new string[2]{"effect","результат"};
			words[286] = new string[2]{"egg","яйцо"};
			words[287] = new string[2]{"eight","восемь"};
			words[288] = new string[2]{"eighteen","восемнадцать"};
			words[289] = new string[2]{"eighty","восемьдесят"};
			words[290] = new string[2]{"electric","электрический"};
			words[291] = new string[2]{"eleven","одиннадцать"};
			words[292] = new string[2]{"end","конец"};
			words[293] = new string[2]{"engine","двигатель"};
			words[294] = new string[2]{"England","Англия"};
			words[295] = new string[2]{"English","англичанин, английский (язык)"};
			words[296] = new string[2]{"enough","довольно, достаточно"};
			words[297] = new string[2]{"equal","равный"};
			words[298] = new string[2]{"error","ошибка"};
			words[299] = new string[2]{"even","даже"};
			words[300] = new string[2]{"event","событие"};
			words[301] = new string[2]{"ever","когда-либо; всегда"};
			words[302] = new string[2]{"every","каждый, всякий"};
			words[303] = new string[2]{"everywhere","везде"};
			words[304] = new string[2]{"example","пример"};
			words[305] = new string[2]{"exchange","обмен"};
			words[306] = new string[2]{"existence","существование"};
			words[307] = new string[2]{"expansion","расширение"};
			words[308] = new string[2]{"expensive","дорогой"};
			words[309] = new string[2]{"experience","опыт"};
			words[310] = new string[2]{"expert","эксперт"};
			words[311] = new string[2]{"eye","глаз"};
			words[312] = new string[2]{"F",""};
			words[313] = new string[2]{"face","лицо"};
			words[314] = new string[2]{"fact","факт"};
			words[315] = new string[2]{"fall","падать"};
			words[316] = new string[2]{"false","ложный"};
			words[317] = new string[2]{"family","семья"};
			words[318] = new string[2]{"far","далеко"};
			words[319] = new string[2]{"farm","ферма"};
			words[320] = new string[2]{"fast","быстро"};
			words[321] = new string[2]{"fat","толстый"};
			words[322] = new string[2]{"father","отец"};
			words[323] = new string[2]{"fear","бояться"};
			words[324] = new string[2]{"feather","перо"};
			words[325] = new string[2]{"February","февраль"};
			words[326] = new string[2]{"feeble","слабый"};
			words[327] = new string[2]{"feel","чувствовать"};
			words[328] = new string[2]{"feeling","чувство"};
			words[329] = new string[2]{"female","женский"};
			words[330] = new string[2]{"fertile","плодородный"};
			words[331] = new string[2]{"fiction","вымысел"};
			words[332] = new string[2]{"field","поле"};
			words[333] = new string[2]{"fifteen","пятнадцать"};
			words[334] = new string[2]{"fifty","пятьдесят"};
			words[335] = new string[2]{"fight","сражаться; сражение"};
			words[336] = new string[2]{"find","находить"};
			words[337] = new string[2]{"finger","палец"};
			words[338] = new string[2]{"Finland","Финляндия"};
			words[339] = new string[2]{"Finn","финн"};
			words[340] = new string[2]{"Finnish","финский (язык)"};
			words[341] = new string[2]{"fir","ель"};
			words[342] = new string[2]{"fire","огонь"};
			words[343] = new string[2]{"firm","фирма"};
			words[344] = new string[2]{"first","первый"};
			words[345] = new string[2]{"fish","рыба"};
			words[346] = new string[2]{"five","пять"};
			words[347] = new string[2]{"flag","флаг"};
			words[348] = new string[2]{"flame","пламя"};
			words[349] = new string[2]{"flat","плоский"};
			words[350] = new string[2]{"floor","пол"};
			words[351] = new string[2]{"flower","цветок"};
			words[352] = new string[2]{"fly","летать"};
			words[353] = new string[2]{"fold","складывать"};
			words[354] = new string[2]{"food","пища, еда"};
			words[355] = new string[2]{"foolish","глупый"};
			words[356] = new string[2]{"foot","ступня"};
			words[357] = new string[2]{"for","для"};
			words[358] = new string[2]{"force","сила"};
			words[359] = new string[2]{"fork","вилка"};
			words[360] = new string[2]{"form","форма"};
			words[361] = new string[2]{"forth","вперёд"};
			words[362] = new string[2]{"forty","сорок"};
			words[363] = new string[2]{"forward","вперёд"};
			words[364] = new string[2]{"four","четыре"};
			words[365] = new string[2]{"fourteen","четырнадцать"};
			words[366] = new string[2]{"fowl","птица (домашняя)"};
			words[367] = new string[2]{"frame","рама"};
			words[368] = new string[2]{"France","Франция"};
			words[369] = new string[2]{"free","свободный"};
			words[370] = new string[2]{"French","француз, французский(язык)"};
			words[371] = new string[2]{"frequent","частый"};
			words[372] = new string[2]{"Friday","пятница"};
			words[373] = new string[2]{"friend","друг"};
			words[374] = new string[2]{"from","из"};
			words[375] = new string[2]{"front","перед"};
			words[376] = new string[2]{"fruit","фрукт"};
			words[377] = new string[2]{"full","полный"};
			words[378] = new string[2]{"fur","шерсть"};
			words[379] = new string[2]{"future","будущий"};
			words[380] = new string[2]{"G",""};
			words[381] = new string[2]{"garden","сад"};
			words[382] = new string[2]{"general","общий"};
			words[383] = new string[2]{"generous","щедрый"};
			words[384] = new string[2]{"German","немец, немецкий (язык)"};
			words[385] = new string[2]{"Germany","Германия"};
			words[386] = new string[2]{"get","получать, доставать"};
			words[387] = new string[2]{"girl","девочка"};
			words[388] = new string[2]{"give","давать"};
			words[389] = new string[2]{"glad","радостный"};
			words[390] = new string[2]{"glass","стакан; стекло"};
			words[391] = new string[2]{"glove","перчатка"};
			words[392] = new string[2]{"go","идти"};
			words[393] = new string[2]{"goat","козёл"};
			words[394] = new string[2]{"gold","золото"};
			words[395] = new string[2]{"golden","золотой"};
			words[396] = new string[2]{"good","хороший"};
			words[397] = new string[2]{"government","правительство"};
			words[398] = new string[2]{"grain","зерно"};
			words[399] = new string[2]{"grass","трава"};
			words[400] = new string[2]{"great","великий"};
			words[401] = new string[2]{"Greece","Греция"};
			words[402] = new string[2]{"greedy","жадный"};
			words[403] = new string[2]{"Greek","грек, греческий (язык)"};
			words[404] = new string[2]{"green","зелёный"};
			words[405] = new string[2]{"grey","серый"};
			words[406] = new string[2]{"grip","схватывать"};
			words[407] = new string[2]{"group","группа"};
			words[408] = new string[2]{"grow","расти"};
			words[409] = new string[2]{"growth","рост"};
			words[410] = new string[2]{"guide","наставник; проводник; гид"};
			words[411] = new string[2]{"gun","оружие"};
			words[412] = new string[2]{"gym","гимнастический зал"};
			words[413] = new string[2]{"H",""};
			words[414] = new string[2]{"hair","волосы"};
			words[415] = new string[2]{"hammer","молоток"};
			words[416] = new string[2]{"hand","кисть руки"};
			words[417] = new string[2]{"hanging","висячий"};
			words[418] = new string[2]{"happy","счастливый"};
			words[419] = new string[2]{"harbour","гавань"};
			words[420] = new string[2]{"hard","твёрдый; упорно, настойчиво"};
			words[421] = new string[2]{"hardly","едва"};
			words[422] = new string[2]{"harmony","гармония"};
			words[423] = new string[2]{"hat","шляпа"};
			words[424] = new string[2]{"hate","ненавидеть"};
			words[425] = new string[2]{"have","иметь"};
			words[426] = new string[2]{"head","голова"};
			words[427] = new string[2]{"healthy","здоровый"};
			words[428] = new string[2]{"hear","слышать"};
			words[429] = new string[2]{"hearing","слух"};
			words[430] = new string[2]{"heart","сердце"};
			words[431] = new string[2]{"heat","жара"};
			words[432] = new string[2]{"Hebrew","иврит, еврейский язык"};
			words[433] = new string[2]{"help","помогать"};
			words[434] = new string[2]{"her","её"};
			words[435] = new string[2]{"here","здесь, сюда"};
			words[436] = new string[2]{"hide","прятать"};
			words[437] = new string[2]{"high","высокий"};
			words[438] = new string[2]{"him","его, ему"};
			words[439] = new string[2]{"Hindi","хинди"};
			words[440] = new string[2]{"Hindu","индус"};
			words[441] = new string[2]{"his","его"};
			words[442] = new string[2]{"history","история"};
			words[443] = new string[2]{"hockey","хоккей"};
			words[444] = new string[2]{"hold","держать"};
			words[445] = new string[2]{"hole","дыра"};
			words[446] = new string[2]{"Holland","Голландия"};
			words[447] = new string[2]{"home","дом; домой"};
			words[448] = new string[2]{"hook","крюк"};
			words[449] = new string[2]{"hope","надеяться"};
			words[450] = new string[2]{"horn","сигнал"};
			words[451] = new string[2]{"horse","лошадь"};
			words[452] = new string[2]{"hospital","больница"};
			words[453] = new string[2]{"hot","горячий"};
			words[454] = new string[2]{"hour","час"};
			words[455] = new string[2]{"house","дом"};
			words[456] = new string[2]{"how","как"};
			words[457] = new string[2]{"humour","юмор"};
			words[458] = new string[2]{"Hungarian","венгр, венгерский(язык)"};
			words[459] = new string[2]{"Hungary","Венгрия"};
			words[460] = new string[2]{"hurt","ранить; вредить"};
			words[461] = new string[2]{"I",""};
			words[462] = new string[2]{"ice","лёд"};
			words[463] = new string[2]{"icecream","мороженое"};
			words[464] = new string[2]{"Iceland","Исландия"};
			words[465] = new string[2]{"Icelander","исландец"};
			words[466] = new string[2]{"Icelandic","исландский (язык)"};
			words[467] = new string[2]{"idea","идея"};
			words[468] = new string[2]{"if","если"};
			words[469] = new string[2]{"ill","больной"};
			words[470] = new string[2]{"important","важный"};
			words[471] = new string[2]{"impulse","импульс"};
			words[472] = new string[2]{"in","в"};
			words[473] = new string[2]{"increase","повышать"};
			words[474] = new string[2]{"India","Индия"};
			words[475] = new string[2]{"Indian","индийский"};
			words[476] = new string[2]{"indifferent","равнодушный"};
			words[477] = new string[2]{"industry","промышленность"};
			words[478] = new string[2]{"ink","чернила"};
			words[479] = new string[2]{"insect","насекомое"};
			words[480] = new string[2]{"inside","внутри, внутрь"};
			words[481] = new string[2]{"instrument","инструмент"};
			words[482] = new string[2]{"insurance","страхование"};
			words[483] = new string[2]{"interest","интерес"};
			words[484] = new string[2]{"invention","изобретение"};
			words[485] = new string[2]{"Ireland","Ирландия"};
			words[486] = new string[2]{"Irish","ирландец, ирландский (язык)"};
			words[487] = new string[2]{"iron","железо"};
			words[488] = new string[2]{"island","остров"};
			words[489] = new string[2]{"Israel","Израиль"};
			words[490] = new string[2]{"Italian","итальянец, итальянский (язык)"};
			words[491] = new string[2]{"Italy","Италия"};
			words[492] = new string[2]{"J",""};
			words[493] = new string[2]{"January","январь"};
			words[494] = new string[2]{"Japan","Япония"};
			words[495] = new string[2]{"Japanese","японец, японский (язык)"};
			words[496] = new string[2]{"jelly","желе"};
			words[497] = new string[2]{"jewel","драгоценный камень"};
			words[498] = new string[2]{"Jewish","еврей, еврейский"};
			words[499] = new string[2]{"join","соединять"};
			words[500] = new string[2]{"journey","путешествие"};
			words[501] = new string[2]{"judge","судья"};
			words[502] = new string[2]{"July","июль"};
			words[503] = new string[2]{"jump","прыгать"};
			words[504] = new string[2]{"June","июнь"};
			words[505] = new string[2]{"just","точно, как раз"};
			words[506] = new string[2]{"K",""};
			words[507] = new string[2]{"keep","держать"};
			words[508] = new string[2]{"kettle","чайник"};
			words[509] = new string[2]{"key","ключ"};
			words[510] = new string[2]{"kick","ударять"};
			words[511] = new string[2]{"kind","добрый"};
			words[512] = new string[2]{"kiss","целовать"};
			words[513] = new string[2]{"kite","воздушный змей"};
			words[514] = new string[2]{"knee","колено"};
			words[515] = new string[2]{"knife","нож"};
			words[516] = new string[2]{"knot","узел"};
			words[517] = new string[2]{"know","знать"};
			words[518] = new string[2]{"knowledge","знание"};
			words[519] = new string[2]{"L",""};
			words[520] = new string[2]{"land","земля"};
			words[521] = new string[2]{"language","язык"};
			words[522] = new string[2]{"last","последний"};
			words[523] = new string[2]{"late","поздний"};
			words[524] = new string[2]{"laugh","смеяться"};
			words[525] = new string[2]{"law","закон"};
			words[526] = new string[2]{"lazy","ленивый"};
			words[527] = new string[2]{"lead","вести"};
			words[528] = new string[2]{"leaf","лист"};
			words[529] = new string[2]{"learning","учение"};
			words[530] = new string[2]{"leather","кожа"};
			words[531] = new string[2]{"leave","оставлять"};
			words[532] = new string[2]{"left","левый"};
			words[533] = new string[2]{"leg","нога"};
			words[534] = new string[2]{"let","позволять"};
			words[535] = new string[2]{"letter","письмо"};
			words[536] = new string[2]{"level","уровень"};
			words[537] = new string[2]{"library","библиотека"};
			words[538] = new string[2]{"lie","лежать"};
			words[539] = new string[2]{"lift","подъём"};
			words[540] = new string[2]{"light","свет"};
			words[541] = new string[2]{"like","любить, нравиться"};
			words[542] = new string[2]{"limit","предел"};
			words[543] = new string[2]{"line","линия"};
			words[544] = new string[2]{"linen","полотно"};
			words[545] = new string[2]{"lip","губа"};
			words[546] = new string[2]{"liquid","жидкость"};
			words[547] = new string[2]{"list","список"};
			words[548] = new string[2]{"little","маленький; мало"};
			words[549] = new string[2]{"live","жить"};
			words[550] = new string[2]{"living","живущий"};
			words[551] = new string[2]{"lock","закрывать"};
			words[552] = new string[2]{"long","длинный"};
			words[553] = new string[2]{"look","смотреть"};
			words[554] = new string[2]{"loose","свободный"};
			words[555] = new string[2]{"lose","терять"};
			words[556] = new string[2]{"loss","потеря"};
			words[557] = new string[2]{"loud","громкий"};
			words[558] = new string[2]{"love","любить"};
			words[559] = new string[2]{"low","низкий"};
			words[560] = new string[2]{"M",""};
			words[561] = new string[2]{"machine","механизм"};
			words[562] = new string[2]{"mailman","почтальон"};
			words[563] = new string[2]{"make","делать"};
			words[564] = new string[2]{"male","мужской"};
			words[565] = new string[2]{"man","мужчина"};
			words[566] = new string[2]{"manager","начальник"};
			words[567] = new string[2]{"map","карта"};
			words[568] = new string[2]{"March","март"};
			words[569] = new string[2]{"mark","отметка"};
			words[570] = new string[2]{"market","рынок"};
			words[571] = new string[2]{"married","женатый, замужняя"};
			words[572] = new string[2]{"mass","масса"};
			words[573] = new string[2]{"match","спичка; матч"};
			words[574] = new string[2]{"material","материальный"};
			words[575] = new string[2]{"May","май"};
			words[576] = new string[2]{"me","меня, мне"};
			words[577] = new string[2]{"meal","еда"};
			words[578] = new string[2]{"meantime","между тем"};
			words[579] = new string[2]{"measure","мера"};
			words[580] = new string[2]{"meat","мясо"};
			words[581] = new string[2]{"mechanic","механик"};
			words[582] = new string[2]{"medical","медицинский"};
			words[583] = new string[2]{"meet","встречать"};
			words[584] = new string[2]{"meeting","встреча"};
			words[585] = new string[2]{"memory","память"};
			words[586] = new string[2]{"metal","металл"};
			words[587] = new string[2]{"Mexican","мексиканец, мексиканский"};
			words[588] = new string[2]{"Mexico","Мексика"};
			words[589] = new string[2]{"middle","середина"};
			words[590] = new string[2]{"military","военный"};
			words[591] = new string[2]{"milk","молоко"};
			words[592] = new string[2]{"mind","ум"};
			words[593] = new string[2]{"minute","минута"};
			words[594] = new string[2]{"mist","туман"};
			words[595] = new string[2]{"mistake","ошибаться"};
			words[596] = new string[2]{"mixed","смешанный"};
			words[597] = new string[2]{"mock","издеваться"};
			words[598] = new string[2]{"modest","скромный"};
			words[599] = new string[2]{"Monday","понедельник"};
			words[600] = new string[2]{"money","деньги"};
			words[601] = new string[2]{"monkey","обезьяна"};
			words[602] = new string[2]{"month","месяц"};
			words[603] = new string[2]{"moon","луна"};
			words[604] = new string[2]{"morning","утро"};
			words[605] = new string[2]{"mother","мать"};
			words[606] = new string[2]{"motion","движение"};
			words[607] = new string[2]{"mountain","гора"};
			words[608] = new string[2]{"mouth","рот"};
			words[609] = new string[2]{"move","двигать"};
			words[610] = new string[2]{"much","много"};
			words[611] = new string[2]{"muscle","мускул"};
			words[612] = new string[2]{"music","музыка"};
			words[613] = new string[2]{"musician","музыкант"};
			words[614] = new string[2]{"my","мой, моя, моё, мои"};
			words[615] = new string[2]{"N",""};
			words[616] = new string[2]{"nail","гвоздь; ноготь"};
			words[617] = new string[2]{"narrow","узкий"};
			words[618] = new string[2]{"nation","нация"};
			words[619] = new string[2]{"natural","естественный"};
			words[620] = new string[2]{"near","рядом"};
			words[621] = new string[2]{"nearly","почти"};
			words[622] = new string[2]{"necessary","необходимый"};
			words[623] = new string[2]{"neck","шея"};
			words[624] = new string[2]{"need","нуждаться"};
			words[625] = new string[2]{"needle","игла"};
			words[626] = new string[2]{"nerve","нерв"};
			words[627] = new string[2]{"net","сеть"};
			words[628] = new string[2]{"never","никогда"};
			words[629] = new string[2]{"new","новый"};
			words[630] = new string[2]{"news","новости"};
			words[631] = new string[2]{"nice","красивый"};
			words[632] = new string[2]{"night","ночь"};
			words[633] = new string[2]{"nine","девять"};
			words[634] = new string[2]{"nineteen","девятнадцать"};
			words[635] = new string[2]{"ninety","девяносто"};
			words[636] = new string[2]{"no","нет"};
			words[637] = new string[2]{"noise","шум"};
			words[638] = new string[2]{"normal","нормальный"};
			words[639] = new string[2]{"north","север"};
			words[640] = new string[2]{"Norway","Норвегия"};
			words[641] = new string[2]{"Norwegian","норвежец, норвежский (язык)"};
			words[642] = new string[2]{"nose","нос"};
			words[643] = new string[2]{"not","не"};
			words[644] = new string[2]{"note","заметка"};
			words[645] = new string[2]{"November","ноябрь"};
			words[646] = new string[2]{"now","сейчас, теперь"};
			words[647] = new string[2]{"nowhere","нигде, никуда"};
			words[648] = new string[2]{"number","число; номер"};
			words[649] = new string[2]{"nut","орех"};
			words[650] = new string[2]{"O",""};
			words[651] = new string[2]{"observation","наблюдение"};
			words[652] = new string[2]{"October","октябрь"};
			words[653] = new string[2]{"off","от, с"};
			words[654] = new string[2]{"offer","предлагать"};
			words[655] = new string[2]{"office","офис"};
			words[656] = new string[2]{"often","часто"};
			words[657] = new string[2]{"oil","растительное масло"};
			words[658] = new string[2]{"old","старый"};
			words[659] = new string[2]{"on","на"};
			words[660] = new string[2]{"one","один"};
			words[661] = new string[2]{"only","только"};
			words[662] = new string[2]{"open","открывать"};
			words[663] = new string[2]{"operation","действие"};
			words[664] = new string[2]{"opinion","мнение"};
			words[665] = new string[2]{"opposite","противоположный"};
			words[666] = new string[2]{"or","или"};
			words[667] = new string[2]{"orange","апельсин; оранжевый"};
			words[668] = new string[2]{"order","порядок"};
			words[669] = new string[2]{"organization","организация"};
			words[670] = new string[2]{"ornament","украшение"};
			words[671] = new string[2]{"other","другой"};
			words[672] = new string[2]{"our","наш"};
			words[673] = new string[2]{"outside","снаружи, наружу"};
			words[674] = new string[2]{"oven","печь"};
			words[675] = new string[2]{"over","над"};
			words[676] = new string[2]{"overhead","наверху"};
			words[677] = new string[2]{"owner","владелец"};
			words[678] = new string[2]{"P",""};
			words[679] = new string[2]{"page","страница"};
			words[680] = new string[2]{"pain","боль"};
			words[681] = new string[2]{"paint","краска"};
			words[682] = new string[2]{"painter","художник"};
			words[683] = new string[2]{"paper","бумага"};
			words[684] = new string[2]{"parallel","параллельный"};
			words[685] = new string[2]{"parcel","посылка"};
			words[686] = new string[2]{"part","часть"};
			words[687] = new string[2]{"past","прошлый"};
			words[688] = new string[2]{"paste","тесто"};
			words[689] = new string[2]{"pay","платить"};
			words[690] = new string[2]{"payment","оплата"};
			words[691] = new string[2]{"peace","мир"};
			words[692] = new string[2]{"pen","ручка"};
			words[693] = new string[2]{"pencil","карандаш"};
			words[694] = new string[2]{"person","человек"};
			words[695] = new string[2]{"physical","физический"};
			words[696] = new string[2]{"picture","картина"};
			words[697] = new string[2]{"pig","свинья"};
			words[698] = new string[2]{"pin","булавка"};
			words[699] = new string[2]{"pink","розовый"};
			words[700] = new string[2]{"pipe","труба"};
			words[701] = new string[2]{"place","место"};
			words[702] = new string[2]{"plane","самолёт"};
			words[703] = new string[2]{"plant","растение; завод"};
			words[704] = new string[2]{"plate","тарелка"};
			words[705] = new string[2]{"play","играть"};
			words[706] = new string[2]{"please","пожалуйста"};
			words[707] = new string[2]{"pleasure","удовольствие"};
			words[708] = new string[2]{"pocket","карман"};
			words[709] = new string[2]{"point","точка"};
			words[710] = new string[2]{"poison","яд"};
			words[711] = new string[2]{"Poland","Польша"};
			words[712] = new string[2]{"policeman","полицейский"};
			words[713] = new string[2]{"Polish","поляк, польский (язык)"};
			words[714] = new string[2]{"political","политический"};
			words[715] = new string[2]{"poor","бедный"};
			words[716] = new string[2]{"porter","носильщик"};
			words[717] = new string[2]{"Portugal","Португалия"};
			words[718] = new string[2]{"Portuguese","португалец, португальский (язык)"};
			words[719] = new string[2]{"position","позиция"};
			words[720] = new string[2]{"possible","возможный"};
			words[721] = new string[2]{"pot","горшок"};
			words[722] = new string[2]{"potato","картофель"};
			words[723] = new string[2]{"powder","порошок"};
			words[724] = new string[2]{"power","сила"};
			words[725] = new string[2]{"practical","практичный"};
			words[726] = new string[2]{"present","присутствующий, настоящий"};
			words[727] = new string[2]{"price","цена"};
			words[728] = new string[2]{"print","печатать"};
			words[729] = new string[2]{"prison","тюрьма"};
			words[730] = new string[2]{"private","частный"};
			words[731] = new string[2]{"probable","вероятный"};
			words[732] = new string[2]{"process","процесс"};
			words[733] = new string[2]{"produce","производить"};
			words[734] = new string[2]{"profit","выгода"};
			words[735] = new string[2]{"property","собственность"};
			words[736] = new string[2]{"prose","проза"};
			words[737] = new string[2]{"protest","протест"};
			words[738] = new string[2]{"proud","гордый"};
			words[739] = new string[2]{"public","общественный"};
			words[740] = new string[2]{"pull","тащить"};
			words[741] = new string[2]{"pump","насос"};
			words[742] = new string[2]{"punishment","наказание"};
			words[743] = new string[2]{"purple","пурпурный"};
			words[744] = new string[2]{"purpose","цель"};
			words[745] = new string[2]{"push","толкать"};
			words[746] = new string[2]{"put","класть, ставить"};
			words[747] = new string[2]{"Q",""};
			words[748] = new string[2]{"quality","качество"};
			words[749] = new string[2]{"question","вопрос"};
			words[750] = new string[2]{"quick","быстрый"};
			words[751] = new string[2]{"quickly","быстро"};
			words[752] = new string[2]{"quiet","тихий"};
			words[753] = new string[2]{"quietly","спокойно"};
			words[754] = new string[2]{"quite","вполне, совсем"};
			words[755] = new string[2]{"R",""};
			words[756] = new string[2]{"rail","рельс"};
			words[757] = new string[2]{"rain","дождь"};
			words[758] = new string[2]{"range","ряд"};
			words[759] = new string[2]{"rarely","редко"};
			words[760] = new string[2]{"rat","крыса"};
			words[761] = new string[2]{"rate","соотношение"};
			words[762] = new string[2]{"ray","луч"};
			words[763] = new string[2]{"reaction","реакция"};
			words[764] = new string[2]{"read","читать"};
			words[765] = new string[2]{"reading","чтение"};
			words[766] = new string[2]{"ready","готовый"};
			words[767] = new string[2]{"reason","причина"};
			words[768] = new string[2]{"receipt","квитанция"};
			words[769] = new string[2]{"record","запись"};
			words[770] = new string[2]{"red","красный"};
			words[771] = new string[2]{"regret","сожалеть"};
			words[772] = new string[2]{"regular","регулярный"};
			words[773] = new string[2]{"relation","отношение"};
			words[774] = new string[2]{"religion","религия"};
			words[775] = new string[2]{"reporter","репортёр"};
			words[776] = new string[2]{"representative","представитель"};
			words[777] = new string[2]{"request","просьба"};
			words[778] = new string[2]{"respect","уважать"};
			words[779] = new string[2]{"rest","отдых"};
			words[780] = new string[2]{"reward","награда"};
			words[781] = new string[2]{"rhythm","ритм"};
			words[782] = new string[2]{"rice","рис"};
			words[783] = new string[2]{"right","правый; правильный"};
			words[784] = new string[2]{"ring","кольцо, звонить"};
			words[785] = null;
			words[786] = new string[2]{"river","река"};
			words[787] = new string[2]{"road","дорога"};
			words[788] = new string[2]{"rod","прут"};
			words[789] = new string[2]{"roll","рулон"};
			words[790] = new string[2]{"roof","крыша"};
			words[791] = new string[2]{"room","комната"};
			words[792] = new string[2]{"root","корень"};
			words[793] = new string[2]{"rough","грубый"};
			words[794] = new string[2]{"round","круглый"};
			words[795] = new string[2]{"rub","тереть"};
			words[796] = new string[2]{"rule","правило"};
			words[797] = new string[2]{"Rumania","Румыния"};
			words[798] = new string[2]{"Rumanian","румын, румынский(язык)"};
			words[799] = new string[2]{"run","бежать"};
			words[800] = new string[2]{"Russia","Россия"};
			words[801] = new string[2]{"Russian","русский; русский (язык)"};
			words[802] = new string[2]{"S",""};
			words[803] = new string[2]{"sad","грустный"};
			words[804] = new string[2]{"safe","безопасный"};
			words[805] = new string[2]{"sail","парус"};
			words[806] = new string[2]{"salt","соль"};
			words[807] = new string[2]{"same","тот жесамый"};
			words[808] = new string[2]{"sand","песок"};
			words[809] = new string[2]{"Saturday","суббота"};
			words[810] = new string[2]{"say","сказать"};
			words[811] = new string[2]{"scale","шкала"};
			words[812] = new string[2]{"scarcely","едва"};
			words[813] = new string[2]{"school","школа"};
			words[814] = new string[2]{"science","наука"};
			words[815] = new string[2]{"scissors","ножницы"};
			words[816] = new string[2]{"screw","винт"};
			words[817] = new string[2]{"sea","море"};
			words[818] = new string[2]{"seat","сиденье"};
			words[819] = new string[2]{"second","второй"};
			words[820] = new string[2]{"secret","тайный"};
			words[821] = new string[2]{"secretary","секретарь"};
			words[822] = new string[2]{"see","видеть"};
			words[823] = new string[2]{"seed","семя"};
			words[824] = new string[2]{"seem","казаться"};
			words[825] = new string[2]{"seldom","редко"};
			words[826] = new string[2]{"selection","выбор"};
			words[827] = new string[2]{"self","себя"};
			words[828] = new string[2]{"sell","продавать"};
			words[829] = new string[2]{"send","посылать"};
			words[830] = new string[2]{"sense","чувство"};
			words[831] = new string[2]{"separate","отдельный"};
			words[832] = new string[2]{"September","сентябрь"};
			words[833] = new string[2]{"serious","серьёзный"};
			words[834] = new string[2]{"servant","слуга"};
			words[835] = new string[2]{"set","ставить"};
			words[836] = new string[2]{"seven","семь"};
			words[837] = new string[2]{"seventeen","семнадцать"};
			words[838] = new string[2]{"seventy","семьдесят"};
			words[839] = new string[2]{"shade","тень"};
			words[840] = new string[2]{"shake","трясти"};
			words[841] = new string[2]{"shame","стыд"};
			words[842] = new string[2]{"sharp","острый"};
			words[843] = new string[2]{"sheep","овца"};
			words[844] = new string[2]{"shelf","полка"};
			words[845] = new string[2]{"ship","корабль"};
			words[846] = new string[2]{"shirt","рубашка"};
			words[847] = new string[2]{"shock","удар"};
			words[848] = new string[2]{"shoe","ботинок"};
			words[849] = new string[2]{"short","низкорослый; короткий"};
			words[850] = new string[2]{"shut","закрывать"};
			words[851] = new string[2]{"side","сторона"};
			words[852] = new string[2]{"sign","знак"};
			words[853] = new string[2]{"silk","шёлк"};
			words[854] = new string[2]{"silver","серебро"};
			words[855] = new string[2]{"simple","простой"};
			words[856] = new string[2]{"since","с техпор"};
			words[857] = new string[2]{"sincere","искренний"};
			words[858] = new string[2]{"sing","петь"};
			words[859] = new string[2]{"sister","сестра"};
			words[860] = new string[2]{"sit","сидеть"};
			words[861] = new string[2]{"six","шесть"};
			words[862] = new string[2]{"sixteen","шестнадцать"};
			words[863] = new string[2]{"sixty","шестьдесят"};
			words[864] = new string[2]{"size","размер"};
			words[865] = new string[2]{"skin","кожа"};
			words[866] = new string[2]{"skirt","юбка"};
			words[867] = new string[2]{"sky","небо"};
			words[868] = new string[2]{"sleep","спать"};
			words[869] = new string[2]{"slip","скользить"};
			words[870] = new string[2]{"slope","наклон"};
			words[871] = new string[2]{"slow","медленный"};
			words[872] = new string[2]{"slowly","медленно"};
			words[873] = new string[2]{"small","маленький"};
			words[874] = new string[2]{"smash","грохот"};
			words[875] = new string[2]{"smell","пахнуть"};
			words[876] = new string[2]{"smile","улыбаться"};
			words[877] = new string[2]{"smoke","курить"};
			words[878] = new string[2]{"smooth","гладкий"};
			words[879] = new string[2]{"snake","змея"};
			words[880] = new string[2]{"sneeze","чихать"};
			words[881] = new string[2]{"snow","снег"};
			words[882] = new string[2]{"so","так"};
			words[883] = new string[2]{"soap","мыло"};
			words[884] = new string[2]{"society","общество"};
			words[885] = new string[2]{"sock","носок"};
			words[886] = new string[2]{"soft","мягкий"};
			words[887] = new string[2]{"solid","твёрдый"};
			words[888] = new string[2]{"some","некоторый"};
			words[889] = new string[2]{"sometimes","иногда"};
			words[890] = new string[2]{"somewhere","где-то, где-нибудь,куда-нибудь"};
			words[891] = new string[2]{"son","сын"};
			words[892] = new string[2]{"song","песня"};
			words[893] = new string[2]{"sort","сорт"};
			words[894] = new string[2]{"sound","звук"};
			words[895] = new string[2]{"soup","суп"};
			words[896] = new string[2]{"south","юг"};
			words[897] = new string[2]{"space","пространство"};
			words[898] = new string[2]{"spade","лопата"};
			words[899] = new string[2]{"Spain","Испания"};
			words[900] = new string[2]{"Spanish","испанец, испанский(язык)"};
			words[901] = new string[2]{"speak","говорить"};
			words[902] = new string[2]{"special","особый"};
			words[903] = new string[2]{"spend","проводить"};
			words[904] = new string[2]{"sponge","губка"};
			words[905] = new string[2]{"spoon","ложка"};
			words[906] = new string[2]{"sport","спорт"};
			words[907] = new string[2]{"sportsman","спортсмен"};
			words[908] = new string[2]{"spring","весна"};
			words[909] = new string[2]{"square","площадь; квадрат"};
			words[910] = new string[2]{"stage","сцена"};
			words[911] = new string[2]{"stamp","печать"};
			words[912] = new string[2]{"stand","стоять"};
			words[913] = new string[2]{"star","звезда"};
			words[914] = new string[2]{"start","начинать"};
			words[915] = new string[2]{"statement","заявление"};
			words[916] = new string[2]{"station","станция"};
			words[917] = new string[2]{"steam","пар"};
			words[918] = new string[2]{"steel","сталь"};
			words[919] = new string[2]{"stem","ствол"};
			words[920] = new string[2]{"step","шаг"};
			words[921] = new string[2]{"stick","палка"};
			words[922] = new string[2]{"sticky","липкий"};
			words[923] = new string[2]{"still","всё ещё, по-прежнему"};
			words[924] = new string[2]{"stitch","шов"};
			words[925] = new string[2]{"stocking","чулок"};
			words[926] = new string[2]{"stomach","живот"};
			words[927] = new string[2]{"stone","камень"};
			words[928] = new string[2]{"stop","останавливать"};
			words[929] = new string[2]{"store","магазин"};
			words[930] = new string[2]{"story","история"};
			words[931] = new string[2]{"straight","прямой"};
			words[932] = new string[2]{"strange","странный"};
			words[933] = new string[2]{"street","улица"};
			words[934] = new string[2]{"stretch","вытягивание"};
			words[935] = new string[2]{"strict","строгий"};
			words[936] = new string[2]{"stroke","удар"};
			words[937] = new string[2]{"strong","сильный"};
			words[938] = new string[2]{"structure","структура"};
			words[939] = new string[2]{"student","студент"};
			words[940] = new string[2]{"stupid","глупый"};
			words[941] = new string[2]{"substance","вещество"};
			words[942] = new string[2]{"such","такой"};
			words[943] = new string[2]{"sudden","внезапный"};
			words[944] = new string[2]{"sugar","сахар"};
			words[945] = new string[2]{"suggestion","предложение"};
			words[946] = new string[2]{"summer","лето"};
			words[947] = new string[2]{"sun","солнце"};
			words[948] = new string[2]{"Sunday","воскресенье"};
			words[949] = new string[2]{"support","поддержка"};
			words[950] = new string[2]{"sure","уверенный"};
			words[951] = new string[2]{"surprise","удивление"};
			words[952] = new string[2]{"sweet","сладкий"};
			words[953] = new string[2]{"swim","плавать"};
			words[954] = new string[2]{"system","система"};
			words[955] = new string[2]{"T",""};
			words[956] = new string[2]{"table","стол"};
			words[957] = new string[2]{"tail","хвост"};
			words[958] = new string[2]{"take","брать"};
			words[959] = new string[2]{"talk","говорить"};
			words[960] = new string[2]{"tall","высокий"};
			words[961] = new string[2]{"taste","вкус"};
			words[962] = new string[2]{"tax","налог"};
			words[963] = new string[2]{"teach","учить"};
			words[964] = new string[2]{"teacher","учитель"};
			words[965] = new string[2]{"teaching","преподавание"};
			words[966] = new string[2]{"tee","чай"};
			words[967] = new string[2]{"tell","сказать"};
			words[968] = new string[2]{"ten","десять"};
			words[969] = new string[2]{"tendency","тенденция"};
			words[970] = new string[2]{"test","тест"};
			words[971] = new string[2]{"than","чем"};
			words[972] = new string[2]{"that","то, тот; что"};
			words[973] = new string[2]{"their","их"};
			words[974] = new string[2]{"them","их, им"};
			words[975] = new string[2]{"then","тогда"};
			words[976] = new string[2]{"theory","теория"};
			words[977] = new string[2]{"there","там, туда"};
			words[978] = new string[2]{"these","эти"};
			words[979] = new string[2]{"thick","толстый"};
			words[980] = new string[2]{"thin","тонкий"};
			words[981] = new string[2]{"thing","вещь"};
			words[982] = new string[2]{"think","думать"};
			words[983] = new string[2]{"third","третий"};
			words[984] = new string[2]{"thirteen","тринадцать"};
			words[985] = new string[2]{"thirty","тридцать"};
			words[986] = new string[2]{"this","это"};
			words[987] = new string[2]{"those","те"};
			words[988] = new string[2]{"though","хотя"};
			words[989] = new string[2]{"thought","мысль"};
			words[990] = new string[2]{"thread","угроза"};
			words[991] = new string[2]{"three","три"};
			words[992] = new string[2]{"throat","горло"};
			words[993] = new string[2]{"through","через"};
			words[994] = new string[2]{"thumb","большой палец"};
			words[995] = new string[2]{"thunder","гром"};
			words[996] = new string[2]{"Thursday","четверг"};
			words[997] = new string[2]{"ticket","билет"};
			words[998] = new string[2]{"tidy","опрятный"};
			words[999] = new string[2]{"tight","тесный"};
			words[1000] = new string[2]{"till","до"};
			words[1001] = new string[2]{"time","время"};
			words[1002] = new string[2]{"tin","олово"};
			words[1003] = new string[2]{"to","к"};
			words[1004] = new string[2]{"today","сегодня"};
			words[1005] = new string[2]{"toe","палец ноги"};
			words[1006] = new string[2]{"together","вместе"};
			words[1007] = new string[2]{"tomorrow","завтра"};
			words[1008] = new string[2]{"tongue","язык"};
			words[1009] = new string[2]{"too","тоже; слишком"};
			words[1010] = new string[2]{"tooth","зуб"};
			words[1011] = new string[2]{"top","вершина"};
			words[1012] = new string[2]{"touch","прикасаться"};
			words[1013] = new string[2]{"tourist","турист"};
			words[1014] = new string[2]{"town","город"};
			words[1015] = new string[2]{"trade","ремесло"};
			words[1016] = new string[2]{"train","поезд"};
			words[1017] = new string[2]{"transport","транспорт"};
			words[1018] = new string[2]{"tray","поднос"};
			words[1019] = new string[2]{"tree","дерево"};
			words[1020] = new string[2]{"trick","приём"};
			words[1021] = new string[2]{"trouble","беда"};
			words[1022] = new string[2]{"trousers","брюки"};
			words[1023] = new string[2]{"true","истинный"};
			words[1024] = new string[2]{"Tuesday","вторник"};
			words[1025] = new string[2]{"Turk","турок"};
			words[1026] = new string[2]{"Turkey","Турция"};
			words[1027] = new string[2]{"Turkish","турецкий (язык)"};
			words[1028] = new string[2]{"turn","поворачивать"};
			words[1029] = new string[2]{"twelve","двенадцать"};
			words[1030] = new string[2]{"twenty","двадцать"};
			words[1031] = new string[2]{"twist","вертеть"};
			words[1032] = new string[2]{"two","два"};
			words[1033] = new string[2]{"U",""};
			words[1034] = new string[2]{"umbrella","зонт"};
			words[1035] = new string[2]{"under","под"};
			words[1036] = new string[2]{"understand","понимать"};
			words[1037] = new string[2]{"understood","понимать"};
			words[1038] = new string[2]{"unit","единица, целое"};
			words[1039] = new string[2]{"United America","СоединённыеШтатыАмерики"};
			words[1040] = new string[2]{"up","вверх, наверху, наверх"};
			words[1041] = new string[2]{"us","нас, нам"};
			words[1042] = new string[2]{"use","использовать"};
			words[1043] = new string[2]{"usually","обычно"};
			words[1044] = new string[2]{"V",""};
			words[1045] = new string[2]{"value","ценить"};
			words[1046] = new string[2]{"verse","стих"};
			words[1047] = new string[2]{"very","очень"};
			words[1048] = new string[2]{"vessel","сосуд"};
			words[1049] = new string[2]{"Viet-Nam","Вьетнам"};
			words[1050] = new string[2]{"Vietnamese","вьетнамец, вьетнамский(язык)"};
			words[1051] = new string[2]{"view","вид"};
			words[1052] = new string[2]{"violent","яростный"};
			words[1053] = new string[2]{"violet","фиолетовый"};
			words[1054] = new string[2]{"voice","голос"};
			words[1055] = new string[2]{"W",""};
			words[1056] = new string[2]{"waiter","официант"};
			words[1057] = new string[2]{"wake","просыпаться"};
			words[1058] = new string[2]{"walk","гулять"};
			words[1059] = new string[2]{"wall","стена"};
			words[1060] = new string[2]{"war","война"};
			words[1061] = new string[2]{"warm","тёплый"};
			words[1062] = new string[2]{"wash","мыть"};
			words[1063] = new string[2]{"waste","тратить"};
			words[1064] = new string[2]{"watch","наручные часы"};
			words[1065] = new string[2]{"water","вода"};
			words[1066] = new string[2]{"wave","волна"};
			words[1067] = new string[2]{"wax","воск"};
			words[1068] = new string[2]{"way","путь; способ"};
			words[1069] = new string[2]{"weather","погода"};
			words[1070] = new string[2]{"Wednesday","среда"};
			words[1071] = new string[2]{"week","неделя"};
			words[1072] = new string[2]{"weight","вес"};
			words[1073] = new string[2]{"well","хорошо"};
			words[1074] = new string[2]{"west","запад"};
			words[1075] = new string[2]{"wet","сырой"};
			words[1076] = new string[2]{"what","что"};
			words[1077] = new string[2]{"wheel","колесо"};
			words[1078] = new string[2]{"when","когда"};
			words[1079] = new string[2]{"where","где; куда"};
			words[1080] = new string[2]{"while","в товремякак"};
			words[1081] = new string[2]{"whip","хлыст"};
			words[1082] = new string[2]{"whistle","свист"};
			words[1083] = new string[2]{"white","белый"};
			words[1084] = new string[2]{"who","кто"};
			words[1085] = new string[2]{"why","почему"};
			words[1086] = new string[2]{"wide","широкий"};
			words[1087] = new string[2]{"wind","ветер"};
			words[1088] = new string[2]{"window","окно"};
			words[1089] = new string[2]{"wine","вино"};
			words[1090] = new string[2]{"wing","крыло"};
			words[1091] = new string[2]{"winter","зима"};
			words[1092] = new string[2]{"wire","проволока"};
			words[1093] = new string[2]{"wise","мудрый"};
			words[1094] = new string[2]{"with","с"};
			words[1095] = new string[2]{"within","внутри"};
			words[1096] = new string[2]{"woman","женщина"};
			words[1097] = new string[2]{"wood","лес"};
			words[1098] = new string[2]{"wool","шерсть"};
			words[1099] = new string[2]{"word","слово"};
			words[1100] = new string[2]{"work","работать"};
			words[1101] = new string[2]{"worker","рабочий"};
			words[1102] = new string[2]{"worm","червяк"};
			words[1103] = new string[2]{"wound","рана"};
			words[1104] = new string[2]{"write","писать"};
			words[1105] = new string[2]{"writer","писатель"};
			words[1106] = new string[2]{"writing","письмо"};
			words[1107] = new string[2]{"wrong","неправильный"};
			words[1108] = new string[2]{"Y",""};
			words[1109] = new string[2]{"year","год"};
			words[1110] = new string[2]{"yellow","жёлтый"};
			words[1111] = new string[2]{"yes","да"};
			words[1112] = new string[2]{"yesterday","вчера"};
			words[1113] = new string[2]{"yet","ещё, уже"};
			words[1114] = new string[2]{"you","ты; вы"};
			words[1115] = new string[2]{"young","молодой"};
			words[1116] = new string[2]{"your","твой, твоя,твоё,твои;ваш,ваша,ваше,ваши"};
			
			foreach(string[] values in words)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO EngRusVocabulary (" +
					"English_Word, Rus_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу EngRusVocabulary.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/* Таблица: Неправильные глаголы https://www.native-english.ru/grammar/irregular-verbs
		 * Поля:
		 * 01. ID - идентификатор
		 * 02. V1_Infivitive - форма глагола 1
		 * 03. V2_PastSimple - форма глагола 2 
		 * 04. V3_PastParticiple - форма глагола 3
		 * 05. V4_PresentParticiple - форма глагола 4
		 * 06. Verb_Translation - перевод на русский
		 */
		void tableIrregularVerbs()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE IrregularVerbs (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[V1_Infivitive] VARCHAR DEFAULT '' UNIQUE, " +
				"[V2_PastSimple] VARCHAR DEFAULT '', " +
				"[V3_PastParticiple] VARCHAR DEFAULT '', " +
				"[V4_PresentParticiple] VARCHAR DEFAULT '', " +
				"[Verb_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы IrregularVerbs.", false, true);
				Application.Exit();
			}
			
			string[][] verbs = new string[100][];
			verbs[0] = new string[5]{"be","was, were","been","being","быть, являться"};
			verbs[1] = new string[5]{"beat","beat","beaten","beating","бить, колотить"};
			verbs[2] = new string[5]{"become","became","become","becomeing","становиться"};
			verbs[3] = new string[5]{"begin","began","begun","beginning","начинать"};
			verbs[4] = new string[5]{"bend","bent","bent","bending","гнуть"};
			verbs[5] = new string[5]{"bet","bet","bet","betting","держать пари"};
			verbs[6] = new string[5]{"bite","bit","bitten","biting","кусать"};
			verbs[7] = new string[5]{"blow","blew","blown","blowing","дуть, выдыхать"};
			verbs[8] = new string[5]{"break","broke","broken","breaking","ломать, разбивать, разрушать"};
			verbs[9] = new string[5]{"bring","brought","brought","bringing","приносить, привозить, доставлять"};
			verbs[10] = new string[5]{"build","built","built","building","строить, сооружать"};
			verbs[11] = new string[5]{"buy","bought","bought","buying","покупать, приобретать"};
			verbs[12] = new string[5]{"catch","caught","caught","catching","ловить, поймать, схватить"};
			verbs[13] = new string[5]{"choose","chose","chosen","choosing","выбирать, избирать"};
			verbs[14] = new string[5]{"come","came","come","coming","приходить, подходить"};
			verbs[15] = new string[5]{"cost","cost","cost","costing","стоить, обходиться"};
			verbs[16] = new string[5]{"cut","cut","cut","cutting","резать, разрезать"};
			verbs[17] = new string[5]{"deal","dealt","dealt","dealing","иметь дело, распределять"};
			verbs[18] = new string[5]{"dig","dug","dug","digging","копать, рыть"};
			verbs[19] = new string[5]{"do","did","done","doing","делать, выполнять"};
			verbs[20] = new string[5]{"draw","drew","drawn","drawing","рисовать, чертить"};
			verbs[21] = new string[5]{"drink","drank","drunk","drinking","пить"};
			verbs[22] = new string[5]{"drive","drove","driven","driving","ездить, подвозить"};
			verbs[23] = new string[5]{"eat","ate","eaten","eating","есть, поглощать, поедать"};
			verbs[24] = new string[5]{"fall","fell","fallen","falling","падать"};
			verbs[25] = new string[5]{"feed","fed","fed","feeding","кормить"};
			verbs[26] = new string[5]{"feel","felt","felt","feeling","чувствовать, ощущать"};
			verbs[27] = new string[5]{"fight","fought","fought","fighting","драться, сражаться, воевать"};
			verbs[28] = new string[5]{"find","found","found","finding","находить, обнаруживать"};
			verbs[29] = new string[5]{"fly","flew","flown","flying","летать"};
			verbs[30] = new string[5]{"forget","forgot","forgotten","forgetting","забывать о (чём-либо)"};
			verbs[31] = new string[5]{"forgive","forgave","forgiven","forgiving","прощать"};
			verbs[32] = new string[5]{"freeze","froze","frozen","freezing","замерзать, замирать"};
			verbs[33] = new string[5]{"get","got","got","getting","получать, добираться"};
			verbs[34] = new string[5]{"give","gave","given","giving","дать, подать, дарить"};
			verbs[35] = new string[5]{"go","went","gone","going","идти, двигаться"};
			verbs[36] = new string[5]{"grow","grew","grown","growing","расти, вырастать"};
			verbs[37] = new string[5]{"hang","hung","hung","hanging","вешать, развешивать, висеть"};
			verbs[38] = new string[5]{"have","had","had","having","иметь, обладать"};
			verbs[39] = new string[5]{"hear","heard","heard","hearing","слышать, услышать"};
			verbs[40] = new string[5]{"hide","hid","hidden","hiding","прятать, скрывать"};
			verbs[41] = new string[5]{"hit","hit","hit","hitting","ударять, поражать"};
			verbs[42] = new string[5]{"hold","held","held","holding","держать, удерживать, задерживать"};
			verbs[43] = new string[5]{"hurt","hurt","hurt","hurting","ранить, причинять боль, ушибить"};
			verbs[44] = new string[5]{"keep","kept","kept","keeping","хранить, сохранять, поддерживать"};
			verbs[45] = new string[5]{"know","knew","known","knowing","знать, иметь представление"};
			verbs[46] = new string[5]{"lay","laid","laid","laying","класть, положить, покрывать"};
			verbs[47] = new string[5]{"lead","led","led","leading","вести за собой, сопровождать, руководить"};
			verbs[48] = new string[5]{"leave","left","left","leaving","покидать, уходить, уезжать, оставлять"};
			verbs[49] = new string[5]{"lend","lent","lent","lending","одалживать, давать взаймы (в долг)"};
			verbs[50] = new string[5]{"let","let","let","letting","позволять, разрешать"};
			verbs[51] = new string[5]{"lie","lay","lain","lying","лежать"};
			verbs[52] = new string[5]{"light","lit","lit","lighting","зажигать, светиться, освещать"};
			verbs[53] = new string[5]{"lose","lost","lost","losing","терять, лишаться, утрачивать"};
			verbs[54] = new string[5]{"make","made","made","making","делать, создавать, изготавливать"};
			verbs[55] = new string[5]{"mean","meant","meant","meaning","значить, иметь в виду, подразумевать"};
			verbs[56] = new string[5]{"meet","met","met","meeting","встречать, знакомиться"};
			verbs[57] = new string[5]{"pay","paid","paid","paying","платить, оплачивать, рассчитываться"};
			verbs[58] = new string[5]{"put","put","put","putting","ставить, помещать, класть"};
			verbs[59] = new string[5]{"read","read","read","reading","читать, прочитать"};
			verbs[60] = new string[5]{"ride","rode","ridden","riding","ехать верхом, кататься"};
			verbs[61] = new string[5]{"ring","rang","rung","ringing","звенеть, звонить"};
			verbs[62] = new string[5]{"rise","rose","risen","rising","восходить, вставать, подниматься"};
			verbs[63] = new string[5]{"run","ran","run","running","бежать, бегать"};
			verbs[64] = new string[5]{"say","said","said","saying","говорить, сказать, произносить"};
			verbs[65] = new string[5]{"see","saw","seen","seeing","видеть"};
			verbs[66] = new string[5]{"seek","sought","sought","seeking","искать, разыскивать"};
			verbs[67] = new string[5]{"sell","sold","sold","selling","продавать, торговать"};
			verbs[68] = new string[5]{"send","sent","sent","sending","посылать, отправлять, отсылать"};
			verbs[69] = new string[5]{"set","set","set","setting","устанавливать, задавать, назначать"};
			verbs[70] = new string[5]{"shake","shook","shaken","shaking","трясти, встряхивать"};
			verbs[71] = new string[5]{"shine","shone","shone","shining","светить, сиять, озарять"};
			verbs[72] = new string[5]{"shoot","shot","shot","shooting","стрелять"};
			verbs[73] = new string[5]{"show","showed","shown, showed","showing","показывать"};
			verbs[74] = new string[5]{"shut","shut","shut","shutting","закрывать, запирать, затворять"};
			verbs[75] = new string[5]{"sing","sang","sung","singing","петь, напевать"};
			verbs[76] = new string[5]{"sink","sank","sunk","sinking","тонуть, погружаться"};
			verbs[77] = new string[5]{"sit","sat","sat","sitting","сидеть, садиться"};
			verbs[78] = new string[5]{"sleep","slept","slept","sleeping","спать"};
			verbs[79] = new string[5]{"speak","spoke","spoken","speaking","говорить, разговаривать, высказываться"};
			verbs[80] = new string[5]{"spend","spent","spent","spending","тратить, расходовать, проводить (время)"};
			verbs[81] = new string[5]{"stand","stood","stood","standing","стоять"};
			verbs[82] = new string[5]{"steal","stole","stolen","stealing","воровать, красть"};
			verbs[83] = new string[5]{"stick","stuck","stuck","sticking","втыкать, приклеивать"};
			verbs[84] = new string[5]{"strike","struck","struck, stricken","striking","ударять, бить, поражать"};
			verbs[85] = new string[5]{"swear","swore","sworn","swearing","клясться, присягать"};
			verbs[86] = new string[5]{"sweep","swept","swept","sweeping","мести, подметать, смахивать"};
			verbs[87] = new string[5]{"swim","swam","swum","swimming","плавать, плыть"};
			verbs[88] = new string[5]{"swing","swung","swung","swinging","качаться, вертеться"};
			verbs[89] = new string[5]{"take","took","taken","taking","брать, хватать, взять"};
			verbs[90] = new string[5]{"teach","taught","taught","teaching","учить, обучать"};
			verbs[91] = new string[5]{"tear","tore","torn","tearing","рвать, отрывать"};
			verbs[92] = new string[5]{"tell","told","told","telling","рассказывать"};
			verbs[93] = new string[5]{"think","thought","thought","thinking","думать, мыслить, размышлять"};
			verbs[94] = new string[5]{"throw","threw","thrown","throwing","бросать, кидать, метать"};
			verbs[95] = new string[5]{"understand","understood","understood","understanding","понимать, постигать"};
			verbs[96] = new string[5]{"wake","woke","woken","waking","просыпаться, будить"};
			verbs[97] = new string[5]{"wear","wore","worn","wearing","носить (одежду)"};
			verbs[98] = new string[5]{"win","won","won","winning","победить, выиграть"};
			verbs[99] = new string[5]{"write","wrote","written","writing","писать, записывать"};
			
			foreach(string[] values in verbs)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO IrregularVerbs (" +
					"V1_Infivitive, V2_PastSimple, V3_PastParticiple, V4_PresentParticiple, Verb_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"', '"+values[2]+"', '"+values[3]+"', '"+values[4]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу IrregularVerbs.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/*
		 * Таблица: Модальные глаголы
		 * 01. ID - идентификатор
		 * 02. Verb_Modal
		 * 03. Verb_Past
		 * 04. Verb_Translation - перевод на русский
		 */
		void tableModalVerbs()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE ModalVerbs (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[Verb_Modal] VARCHAR DEFAULT '' UNIQUE, " +
				"[Verb_Past] VARCHAR DEFAULT '', " +
				"[Verb_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы ModalVerbs.", false, true);
				Application.Exit();
			}
			
			string[][] verbs = new string[7][];
			verbs[0] = new string[3]{"can","could","мочь"};
			verbs[1] = new string[3]{"may","might","мочь"};
			verbs[2] = new string[3]{"will","would","увереность, предложение, угроза, просьба"};
			verbs[3] = new string[3]{"shall","should","намереваться, долженствовать"};
			verbs[4] = new string[3]{"must","hand to","должен"};
			verbs[5] = new string[3]{"ought to","-","должен"};
			verbs[6] = new string[3]{"need","needed","нежно"};
			
			foreach(string[] values in verbs)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO ModalVerbs (" +
					"Verb_Modal, Verb_Past, Verb_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"', '"+values[2]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу ModalVerbs.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/* Таблица: Правильные глаголы http://englishfox.ru/pravilnye-glagoly-s-perevodom.html
		 * Поля:
		 * 01. ID - идентификатор
		 * 02. V1_Infivitive - форма глагола 1
		 * 03. V2_PastSimple - форма глагола 2 
		 * 04. V3_PastParticiple - форма глагола 3
		 * 05. V4_PresentParticiple - форма глагола 4
		 * 06. Verb_Translation - перевод на русский
		 */
		void tableRegularVerbs()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE RegularVerbs (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[V1_Infivitive] VARCHAR DEFAULT '' UNIQUE, " +
				"[V2_PastSimple] VARCHAR DEFAULT '', " +
				"[V3_PastParticiple] VARCHAR DEFAULT '', " +
				"[V4_PresentParticiple] VARCHAR DEFAULT '', " +
				"[Verb_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы RegularVerbs.", false, true);
				Application.Exit();
			}
			
			string[][] verbs = new string[70][];
			verbs[0] = new string[5]{"ask","asked","asked","asking","спрашивать"};
			verbs[1] = new string[5]{"answer","answered","answered","answering","отвечать"};
			verbs[2] = new string[5]{"allow","allowed","allowed","allowing","позволять"};
			verbs[3] = new string[5]{"agree","agreed","agreed","agreeing","соглашаться"};
			verbs[4] = new string[5]{"borrow","borrowed","borrowed","borrowing","занимать"};
			verbs[5] = new string[5]{"believe","believed","believed","believing","верить"};
			verbs[6] = new string[5]{"copy","copied","copied","copying","копировать"};
			verbs[7] = new string[5]{"cook","cooked","cooked","cooking","готовить"};
			verbs[8] = new string[5]{"close","closed","closed","closing","закрывать"};
			verbs[9] = new string[5]{"change","changed","changed","changing","менять"};
			verbs[10] = new string[5]{"carry","carried","carried","carrying","носить"};
			verbs[11] = new string[5]{"call","called","called","calling","звонить"};
			verbs[12] = new string[5]{"die","died","died","dying","умереть"};
			verbs[13] = new string[5]{"discuss","discussed","discussed","discussing","обсуждать"};
			verbs[14] = new string[5]{"decide","decided","decided","deciding","решать"};
			verbs[15] = new string[5]{"enjoy","enjoyed","enjoyed","enjoying","наслаждаться"};
			verbs[16] = new string[5]{"explain","explained","explained","explaining","объяснять"};
			verbs[17] = new string[5]{"slip","slipped","slipped","slipping","скользить"};
			verbs[18] = new string[5]{"cry","cried","cried","crying","плакать, кричать"};
			verbs[19] = new string[5]{"finish","finished","finished","finishing","заканчивать"};
			verbs[20] = new string[5]{"flow","flowed","flowed","flowing","течь"};
			verbs[21] = new string[5]{"found","founded","founded","founding","основать"};
			verbs[22] = new string[5]{"admit","admitted","admitted","admitting","принять, признать"};
			verbs[23] = new string[5]{"glow","glowed","glowed","glowing","светиться"};
			verbs[24] = new string[5]{"grate","grated","grated","grating","натирать, расти"};
			verbs[25] = new string[5]{"grip","gripped","gripped","gripping","схватить"};
			verbs[26] = new string[5]{"help","helped","helped","helping","помогать"};
			verbs[27] = new string[5]{"happen","happened","happened","happening","случаться"};
			verbs[28] = new string[5]{"handle","handled","handled","handling","управлять"};
			verbs[29] = new string[5]{"hang","hanged","hanged","hanging","казнить через повешение"};
			verbs[30] = new string[5]{"hurry","hurried","hurried","hurrying","спешить"};
			verbs[31] = new string[5]{"look","looked","looked","looking","смотреть"};
			verbs[32] = new string[5]{"live","lived","lived","living","жить"};
			verbs[33] = new string[5]{"listen","listened","listened","listening","слушать"};
			verbs[34] = new string[5]{"like","liked","liked","liking","нравится"};
			verbs[35] = new string[5]{"move","moved","moved","moving","двигать"};
			verbs[36] = new string[5]{"manage","managed","managed","managing","руководить"};
			verbs[37] = new string[5]{"marry","married","married","marrying","жениться"};
			verbs[38] = new string[5]{"need","needed","needed","needing","нуждаться"};
			verbs[39] = new string[5]{"nod","nodded","nodded","nodding","кивать"};
			verbs[40] = new string[5]{"open","opened","opened","opening","открывать"};
			verbs[41] = new string[5]{"offer","offered","offered","offering","предлагать"};
			verbs[42] = new string[5]{"occur","occurred","occurred","occurring","происходить, случаться"};
			verbs[43] = new string[5]{"remember","remembered","remembered","remembering","помнить"};
			verbs[44] = new string[5]{"rob","robbed","robbed","robbing","грабить"};
			verbs[45] = new string[5]{"promise","promised","promised","promising","обещать"};
			verbs[46] = new string[5]{"play","played","played","playing","играть"};
			verbs[47] = new string[5]{"plan","planned","planned","planning","планировать"};
			verbs[48] = new string[5]{"prefer","preferred","preferred","preferring","предпочитать"};
			verbs[49] = new string[5]{"refer","referred","referred","referring","направлять"};
			verbs[50] = new string[5]{"scan","scanned","scanned","scanning","сканировать"};
			verbs[51] = new string[5]{"ski","skied","skied","skiing","кататься на лыжах"};
			verbs[52] = new string[5]{"stay","stayed","stayed","staying","оставаться"};
			verbs[53] = new string[5]{"suggest","suggested","suggested","suggesting","предлагать"};
			verbs[54] = new string[5]{"study","studied","studied","studying","изучать"};
			verbs[55] = new string[5]{"stop","stopped","stopped","stopping","останавливать"};
			verbs[56] = new string[5]{"start","started","started","starting","начинать"};
			verbs[57] = new string[5]{"swap","swapped","swapped","swapping","обменяться чем-либо"};
			verbs[58] = new string[5]{"travel","travelled","travelled","travelling","путешествовать"};
			verbs[59] = new string[5]{"talk","talked","talked","talking","говорить"};
			verbs[60] = new string[5]{"translate","translated","translated","translating","переводить"};
			verbs[61] = new string[5]{"try","tried","tried","trying","пытаться"};
			verbs[62] = new string[5]{"tie","tied","tied","ting","завязывать"};
			verbs[63] = new string[5]{"queue","queued","queued","queuing","сотять в очереди"};
			verbs[64] = new string[5]{"use","used","used","using","использовать"};
			verbs[65] = new string[5]{"worry","worried","worried","worrying","беспокоиться"};
			verbs[66] = new string[5]{"work","worked","worked","working","работать"};
			verbs[67] = new string[5]{"watch","watched","watched","watching","смотреть"};
			verbs[68] = new string[5]{"walk","walked","walked","walking","ходить"};
			verbs[69] = new string[5]{"wait","waited","waited","waiting","ждать"};
			
			foreach(string[] values in verbs)
			{
				if(values == null) continue;
				/*
				sqlCommand = "INSERT INTO RegularVerbs (" +
					"Verb, Verb_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
					*/
				
				sqlCommand = "INSERT INTO RegularVerbs (" +
					"V1_Infivitive, V2_PastSimple, V3_PastParticiple, V4_PresentParticiple, Verb_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"', '"+values[2]+"', '"+values[3]+"', '"+values[4]+"')";
				
				
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу RegularVerbs.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/* Таблица: Местоимения http://engblog.ru/pronouns
		 * Поля:
		 * 01. ID - идентификатор
		 * 02. Pronoun - местоимение
		 * 03. Pronoun_Translation - перевод на русский
		 */
		void tablePronouns()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE Pronouns (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[Pronoun] VARCHAR DEFAULT '', " +
				"[Pronoun_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Pronouns.", false, true);
				Application.Exit();
			}
			
			string[][] pronouns = new string[57][];
			pronouns[0] = new string[2]{"","ЛИЧНЫЕ МЕСТОИМЕНИЯ"};
			pronouns[1] = new string[2]{"I","я"};
			pronouns[2] = new string[2]{"you","ты, вы"};
			pronouns[3] = new string[2]{"he","он"};
			pronouns[4] = new string[2]{"she","она"};
			pronouns[5] = new string[2]{"it","оно, она, он"};
			pronouns[6] = new string[2]{"we","мы"};
			pronouns[7] = new string[2]{"you","вы"};
			pronouns[8] = new string[2]{"they","они"};
			pronouns[9] = new string[2]{"","ПРИТЯЖАТЕЛЬНЫЕ МЕСТОИМЕНИЯ"};
			pronouns[10] = new string[2]{"my","мой"};
			pronouns[11] = new string[2]{"your","твой"};
			pronouns[12] = new string[2]{"his","его"};
			pronouns[13] = new string[2]{"her","её"};
			pronouns[14] = new string[2]{"its","его, её"};
			pronouns[15] = new string[2]{"our","наш"};
			pronouns[16] = new string[2]{"your","ваш"};
			pronouns[17] = new string[2]{"their","их"};
			pronouns[18] = new string[2]{"","ВОЗРАТНЫЕ МЕСТОИМЕНИЯ"};
			pronouns[19] = new string[2]{"myself","я сам"};
			pronouns[20] = new string[2]{"yourself","ты сам"};
			pronouns[21] = new string[2]{"himself","он сам"};
			pronouns[22] = new string[2]{"herself","она сама"};
			pronouns[23] = new string[2]{"itself","оно само"};
			pronouns[24] = new string[2]{"ourselves","мы сами"};
			pronouns[25] = new string[2]{"yourselves","вы сами"};
			pronouns[26] = new string[2]{"themselves","они сами"};
			pronouns[27] = new string[2]{"oneself","сам"};
			pronouns[28] = new string[2]{"","УКАЗАТЕЛЬНЫЕ МЕСТОИМЕНИЯ"};
			pronouns[29] = new string[2]{"this","этот, эта, это"};
			pronouns[30] = new string[2]{"that","тот, та, то"};
			pronouns[31] = new string[2]{"such","такой, подобный"};
			pronouns[32] = new string[2]{"the same","тот же самый"};
			pronouns[33] = new string[2]{"it","это"};
			pronouns[34] = new string[2]{"these","эти"};
			pronouns[35] = new string[2]{"those","те"};
			pronouns[36] = new string[2]{"such","такие, подобные"};
			pronouns[37] = new string[2]{"the same","те же самые"};
			pronouns[38] = new string[2]{"","ВОПРОСИТЕЛЬНЫЕ МЕСТОИМЕНИЯ"};
			pronouns[39] = new string[2]{"who","кто, кого"};
			pronouns[40] = new string[2]{"what","что, какой"};
			pronouns[41] = new string[2]{"which","который"};
			pronouns[42] = new string[2]{"whose","чей"};
			pronouns[43] = new string[2]{"whom","кого, чему"};
			pronouns[44] = new string[2]{"","НЕОПРЕДЕЛЁННЫЕ МЕСТОИМЕНИЯ"};
			pronouns[45] = new string[2]{"some","некоторые"};
			pronouns[46] = new string[2]{"somebody","кто-то, кто-нибудь"};
			pronouns[47] = new string[2]{"someone","кто-то, кто-нибудь"};
			pronouns[48] = new string[2]{"something","что-то, что-нибудь"};
			pronouns[49] = new string[2]{"any","любой"};
			pronouns[50] = new string[2]{"anybody","кто-нибудь, всякий, любой, никто"};
			pronouns[51] = new string[2]{"anyone","кто-нибудь, всякий, любой, никто"};
			pronouns[52] = new string[2]{"anything","что-нибудь, все, ничто"};
			pronouns[53] = new string[2]{"no","нет"};
			pronouns[54] = new string[2]{"nobody","никто"};
			pronouns[55] = new string[2]{"no one","никто"};
			pronouns[56] = new string[2]{"nothing","ничто, ничего"};
			
			foreach(string[] values in pronouns)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Pronouns (Pronoun, Pronoun_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Pronouns.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/*
		 * Таблица: Артикль
		 * 01. ID - идентификатор
		 * 02. Article_English - артикль на английском
		 * 03. Article_Translation - перевод на русский
		 */
		void tableArticles()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE Articles (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[Article_English] VARCHAR DEFAULT '', " +
				"[Article_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Articles.", false, true);
				Application.Exit();
			}
			
			string[][] articles = new string[5][];
			articles[0] = new string[2]{"","НЕОПРЕДЕЛЕННЫЙ АРТИКЛЬ"};
			articles[1] = new string[2]{"a","Для существительных начинающихся с согласного звука (единственное число)"};
			articles[2] = new string[2]{"an","Для существительных начинающихся с гласного звука (единственное число)"};
			articles[3] = new string[2]{"","ОПРЕДЕЛЕННЫЙ АРТИКЛЬ"};
			articles[4] = new string[2]{"the","Для существительных начинающихся с согласного или гласного звука (единственное или множественное число)"};
			
			foreach(string[] values in articles)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Articles (Article_English, Article_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Articles.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/*
		 * Таблица: Существительное
		 * 01. ID - идентификатор
		 * 02. Singular_Noun - единственное число
		 * 03. Plural_Noun - множественное число
		 * 04. Noun_Translation - перевод на русский
		 */
		void tableNouns()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE Nouns (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[Singular_Noun] VARCHAR DEFAULT '', " +
				"[Plural_Noun] VARCHAR DEFAULT '', " +
				"[Noun_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Nouns.", false, true);
				Application.Exit();
			}
			
			string[][] nouns = new string[48][];
			nouns[0] = new string[3]{"child","children","ребёнок - дети"};
			nouns[1] = new string[3]{"foot","feet","стопа - стопы"};
			nouns[2] = new string[3]{"man","men","мужчина - мужчины"};
			nouns[3] = new string[3]{"mouse","mice","мышь - мыши"};
			nouns[4] = new string[3]{"person","people","человек - люди"};
			nouns[5] = new string[3]{"sheep","sheep","овца - овцы"};
			nouns[6] = new string[3]{"tooth","teeth","зуб - зубы"};
			nouns[7] = new string[3]{"woman","women","женщина - женщины"};
			nouns[8] = new string[3]{"advice","-","совет"};
			nouns[9] = new string[3]{"courage","-","мужество"};
			nouns[10] = new string[3]{"freedom","-","свобода"};
			nouns[11] = new string[3]{"friendship","-","дружба"};
			nouns[12] = new string[3]{"hardness","-","твердость"};
			nouns[13] = new string[3]{"information","-","информация"};
			nouns[14] = new string[3]{"knowledge","-","знание"};
			nouns[15] = new string[3]{"love","-","любовь"};
			nouns[16] = new string[3]{"music","-","музыка"};
			nouns[17] = new string[3]{"permission","-","позволение"};
			nouns[18] = new string[3]{"progress","-","прогресс"};
			nouns[19] = new string[3]{"struggle","-","борьба"};
			nouns[20] = new string[3]{"strength","-","сила"};
			nouns[21] = new string[3]{"success","-","успех"};
			nouns[22] = new string[3]{"air","-","воздух"};
			nouns[23] = new string[3]{"butter","-","масло"};
			nouns[24] = new string[3]{"gold","-","золото"};
			nouns[25] = new string[3]{"iron","-","железо"};
			nouns[26] = new string[3]{"snow","-","снег"};
			nouns[27] = new string[3]{"steel","-","сталь"};
			nouns[28] = new string[3]{"water","-","вода"};
			nouns[29] = new string[3]{"milk","-","молоко"};
			nouns[30] = new string[3]{"economics","-","экономика"};
			nouns[31] = new string[3]{"mathematics","-","математика"};
			nouns[32] = new string[3]{"physics","-","физика"};
			nouns[33] = new string[3]{"phonetics","-","фонетика"};
			nouns[34] = new string[3]{"news","-","новость"};
			nouns[35] = new string[3]{"money","-","деньги"};
			nouns[36] = new string[3]{"-","binoculars","бинокль"};
			nouns[37] = new string[3]{"-","glasses","очки"};
			nouns[38] = new string[3]{"-","jeans","джинсы"};
			nouns[39] = new string[3]{"-","pants","трусы"};
			nouns[40] = new string[3]{"-","pliers","щипцы"};
			nouns[41] = new string[3]{"-","pyjamas","пижама"};
			nouns[42] = new string[3]{"-","scissors","ножницы"};
			nouns[43] = new string[3]{"-","swimming trunks","плавки"};
			nouns[44] = new string[3]{"-","tights","колготки"};
			nouns[45] = new string[3]{"-","trousers","врюки"};
			nouns[46] = new string[3]{"-","goods","товар"};
			nouns[47] = new string[3]{"-","clothes","одежда"};


			foreach(string[] values in nouns)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Nouns (Singular_Noun, Plural_Noun, Noun_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+ "', '"+values[2]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Nouns.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/*
		 * Таблица: Прилагательное
		 * 01. ID - идентификатор
		 * 02. Positive - положительная степень
		 * 03. Comparative - сравнительная степень
		 * 04. Superlative - превосходная степень
		 * 05. Adjective_Translation - перевод на русский
		 */
		void tableAdjective()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE Adjective (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[Positive] VARCHAR DEFAULT '', " +
				"[Comparative] VARCHAR DEFAULT '', " +
				"[Superlative] VARCHAR DEFAULT '', " +
				"[Adjective_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Adjective.", false, true);
				Application.Exit();
			}
			
			string[][] adjective = new string[20][];
			adjective[0] = new string[4]{"short","shorter","shortest","короткий"};
			adjective[1] = new string[4]{"big","bigger","biggest","большой"};
			adjective[2] = new string[4]{"happy","happier","happiest","счастливый"};
			adjective[3] = new string[4]{"large","larger","largest","большой"};
			adjective[4] = new string[4]{"useful","more useful","most useful","полезный"};
			adjective[5] = new string[4]{"a most difficult","","","крайне трудный"};
			adjective[6] = new string[4]{"ever so interesting","","","чрезвычайно интересный"};
			adjective[7] = new string[4]{"only too glad","","","очень довольный"};
			adjective[8] = new string[4]{"","much more advanced","","гораздо более передовые"};
			adjective[9] = new string[4]{"","a great deal faster","","гораздо быстрее"};
			adjective[10] = new string[4]{"","still easier","","ещё легче"};
			adjective[11] = new string[4]{"","an ever greater","","значительно больший"};
			adjective[12] = new string[4]{"","all the more complicated","","ещё сложнее"};
			adjective[13] = new string[4]{"","not any cleaner","","ничуть не ясней"};
			adjective[14] = new string[4]{"","","the nearest possible","ближайший, какой только возможен"};
			adjective[15] = new string[4]{"","","the cheapest to be found","самый дешёвый, какой только можно найти"};
			adjective[16] = new string[4]{"good","better","best","хороший/лучше/наилучший"};
			adjective[17] = new string[4]{"bad","worse","worst","плохой/хуже/наихудший"};
			adjective[18] = new string[4]{"little","less","least","маленький/более маленький/наименьший"};
			adjective[19] = new string[4]{"far","farther/further","farthest/furthest","далёкий/более отдалённый/дальнейший"};
			
			foreach(string[] values in adjective)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Adjective (Positive, Comparative, Superlative, Adjective_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+ "', '"+values[2]+"', '"+values[3]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Adjective.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/*
		 * Таблица: Числительное
		 * 01. ID - идентификатор
		 * 02. Numeral_English - числитеное на английском
		 * 03. Numeral_Translation - перевод на русский
		 */
		void tableNumeral()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE Numeral (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[Numeral_English] VARCHAR DEFAULT '', " +
				"[Numeral_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Numeral.", false, true);
				Application.Exit();
			}
			
			string[][] numerals = new string[170][];
			numerals[0] = new string[2]{"one","1"};
			numerals[1] = new string[2]{"two","2"};
			numerals[2] = new string[2]{"three","3"};
			numerals[3] = new string[2]{"four","4"};
			numerals[4] = new string[2]{"five","5"};
			numerals[5] = new string[2]{"six","6"};
			numerals[6] = new string[2]{"seven","7"};
			numerals[7] = new string[2]{"eight","8"};
			numerals[8] = new string[2]{"nine","9"};
			numerals[9] = new string[2]{"ten","10"};
			numerals[10] = new string[2]{"eleven","11"};
			numerals[11] = new string[2]{"twelve","12"};
			numerals[12] = new string[2]{"thirteen","13"};
			numerals[13] = new string[2]{"fourteen","14"};
			numerals[14] = new string[2]{"fifteen","15"};
			numerals[15] = new string[2]{"sixteen","16"};
			numerals[16] = new string[2]{"seventeen","17"};
			numerals[17] = new string[2]{"eighteen","18"};
			numerals[18] = new string[2]{"nineteen","19"};
			numerals[19] = new string[2]{"twenty","20"};
			numerals[20] = new string[2]{"twenty-one","21"};
			numerals[21] = new string[2]{"twenty-two","22"};
			numerals[22] = new string[2]{"twenty-three","23"};
			numerals[23] = new string[2]{"twenty-four","24"};
			numerals[24] = new string[2]{"twenty-five","25"};
			numerals[25] = new string[2]{"twenty-six","26"};
			numerals[26] = new string[2]{"twenty-seven","27"};
			numerals[27] = new string[2]{"twenty-eight","28"};
			numerals[28] = new string[2]{"twenty-nine","29"};
			numerals[29] = new string[2]{"thirty","30"};
			numerals[30] = new string[2]{"forty","40"};
			numerals[31] = new string[2]{"fifty","50"};
			numerals[32] = new string[2]{"sixty","60"};
			numerals[33] = new string[2]{"seventy","70"};
			numerals[34] = new string[2]{"eighty","80"};
			numerals[35] = new string[2]{"ninety","90"};
			numerals[36] = new string[2]{"a (one) hundred","100"};
			numerals[37] = new string[2]{"two hundred","200"};
			numerals[38] = new string[2]{"two hundred and forty-six","246"};
			numerals[39] = new string[2]{"three hundred","300"};
			numerals[40] = new string[2]{"four hundred","400"};
			numerals[41] = new string[2]{"five hundred","500"};
			numerals[42] = new string[2]{"six hundred","600"};
			numerals[43] = new string[2]{"seven hundred","700"};
			numerals[44] = new string[2]{"eight hundred","800"};
			numerals[45] = new string[2]{"nine hundred","900"};
			numerals[46] = new string[2]{"five thousand and five","5,005"};
			numerals[47] = new string[2]{"five thousand and fifty","5,050"};
			numerals[48] = new string[2]{"","АРИФМЕТИЧЕСКИЕ ОПЕРАЦИИ"};
			numerals[49] = new string[2]{"two plus four is (are) six","2 + 4 = 6"};
			numerals[50] = new string[2]{"nine minus five is (are) four","9 – 5 = 4"};
			numerals[51] = new string[2]{"five times five is (are; makes) twenty-five","5 × 5 = 25"};
			numerals[52] = new string[2]{"nine divided by (over) three is (equals) three","9 : 3 = 3"};
			numerals[53] = new string[2]{"","Проценты"};
			numerals[54] = new string[2]{"one percent","1 процент"};
			numerals[55] = new string[2]{"two percent","2 процента"};
			numerals[56] = new string[2]{"fifty-seven percent","57 процентов"};
			numerals[57] = new string[2]{"","ПОРЯДКОВЫЕ ЧИСЛИТЕЛЬНЫЕ"};
			numerals[58] = new string[2]{"first","1-й"};
			numerals[59] = new string[2]{"second","2-й"};
			numerals[60] = new string[2]{"third","3-й"};
			numerals[61] = new string[2]{"fourth","4-й"};
			numerals[62] = new string[2]{"fifth","5-й"};
			numerals[63] = new string[2]{"sixth","6-й"};
			numerals[64] = new string[2]{"seventh","7-й"};
			numerals[65] = new string[2]{"eighth","8-й"};
			numerals[66] = new string[2]{"ninth","9-й"};
			numerals[67] = new string[2]{"tenth","10-й"};
			numerals[68] = new string[2]{"eleventh","11-й"};
			numerals[69] = new string[2]{"twelfth","12-й"};
			numerals[70] = new string[2]{"thirteen","13-й"};
			numerals[71] = new string[2]{"fourteen","14-й"};
			numerals[72] = new string[2]{"fifteen","15-й"};
			numerals[73] = new string[2]{"sixteen","16-й"};
			numerals[74] = new string[2]{"seventeen","17-й"};
			numerals[75] = new string[2]{"eighteen","18-й"};
			numerals[76] = new string[2]{"nineteen","19-й"};
			numerals[77] = new string[2]{"twenty","20-й"};
			numerals[78] = new string[2]{"thirty","30-й"};
			numerals[79] = new string[2]{"forty","40-й"};
			numerals[80] = new string[2]{"fifty","50-й"};
			numerals[81] = new string[2]{"sixty","60-й"};
			numerals[82] = new string[2]{"seventy","70-й"};
			numerals[83] = new string[2]{"eighty","80-й"};
			numerals[84] = new string[2]{"ninety","90-й"};
			numerals[85] = new string[2]{"one hundred","100-й"};
			numerals[86] = new string[2]{"","ДАТА"};
			numerals[87] = new string[2]{"eighteen fifty-five","1855 год"};
			numerals[88] = new string[2]{"nineteen seventeen","1917 год"};
			numerals[89] = new string[2]{"was born in","родился в"};
			numerals[90] = new string[2]{"and died in","умер в"};
			numerals[91] = new string[2]{"","ВРЕМЯ"};
			numerals[92] = new string[2]{"ten past four, ten after four","4:10"};
			numerals[93] = new string[2]{"a quarter to five","4:45"};
			numerals[94] = new string[2]{"twelve (minutes) past five","5:12"};
			numerals[95] = new string[2]{"twelve (minutes) after five","5:12"};
			numerals[96] = new string[2]{"twenty-five minutes past five","5:25"};
			numerals[97] = new string[2]{"twenty-five after five","5:25"};
			numerals[98] = new string[2]{"twenty (minutes) to six","5:40"};
			numerals[99] = new string[2]{"five forty","5:40"};
			numerals[100] = new string[2]{"seven minutes past six","6:07"};
			numerals[101] = new string[2]{"seven after six","6:07"};
			numerals[102] = new string[2]{"a quarter past six","6:15"};
			numerals[103] = new string[2]{"six fifteen","6:15"};
			numerals[104] = new string[2]{"a quarter to seven","6:45"};
			numerals[105] = new string[2]{"six forty-five","6:45"};
			numerals[106] = new string[2]{"a quarter to eight","7:45"};
			numerals[107] = new string[2]{"a quarter past eight","8:15"};
			numerals[108] = new string[2]{"eight fifteen","8:15"};
			numerals[109] = new string[2]{"half past eight","8:30"};
			numerals[110] = new string[2]{"eight thirty","8:30"};
			numerals[111] = new string[2]{"a quarter to nine","8:45"};
			numerals[112] = new string[2]{"eight forty-five","8:45"};
			numerals[113] = new string[2]{"nine oh three","9:03"};
			numerals[114] = new string[2]{"nine ten","9:10"};
			numerals[115] = new string[2]{"nine fifteen","9:15"};
			numerals[116] = new string[2]{"half past nine","9:30"};
			numerals[117] = new string[2]{"nine thirty","9:30"};
			numerals[118] = new string[2]{"nine thirty-six","9:36"};
			numerals[119] = new string[2]{"a quarter to ten","9:45"};
			numerals[120] = new string[2]{"nine forty-five","9:45"};
			numerals[121] = new string[2]{"a quarter past ten","10:15"};
			numerals[122] = new string[2]{"ten fifteen","10:15"};
			numerals[123] = new string[2]{"ten thirty","10:30"};
			numerals[124] = new string[2]{"half past ten","10:30"};
			numerals[125] = new string[2]{"a quarter past twelve","12:15"};
			numerals[126] = new string[2]{"half past twelve","12:30"};
			numerals[127] = new string[2]{"twelve thirty","12:30"};
			numerals[128] = new string[2]{"ten (minutes) to one","12:50"};
			numerals[129] = new string[2]{"twelve fifty","12:50"};
			numerals[130] = new string[2]{"twenty-one oh three","21:03"};
			numerals[131] = new string[2]{"twenty-one ten","21:10"};
			numerals[132] = new string[2]{"twenty-one fifteen","21:15"};
			numerals[133] = new string[2]{"twenty-one thirty","21:30"};
			numerals[134] = new string[2]{"twenty-one thirty-six","21:36"};
			numerals[135] = new string[2]{"twenty-one forty-five","21:45"};
			numerals[136] = new string[2]{"","ДРОБНЫЕ ЧИСЛИТЕЛЬНЫЕ"};
			numerals[137] = new string[2]{"a (one) third","1/3"};
			numerals[138] = new string[2]{"two thirds","2/3"};
			numerals[139] = new string[2]{"a (one) fifth","1/5"};
			numerals[140] = new string[2]{"three fifths","3/5"};
			numerals[141] = new string[2]{"a (one) sixth","1/6"};
			numerals[142] = new string[2]{"four ninths","4/9"};
			numerals[143] = new string[2]{"nine tenths","9/10"};
			numerals[144] = new string[2]{"a (one) hundredth","1/100"};
			numerals[145] = new string[2]{"one and a half","11/2"};
			numerals[146] = new string[2]{"two and a half","21/2"};
			numerals[147] = new string[2]{"a (one) half","1/2"};
			numerals[148] = new string[2]{"a (one) quarter","1/4"};
			numerals[149] = new string[2]{"point eight","0.8"};
			numerals[150] = new string[2]{"point nought nought six","0.006"};
			numerals[151] = new string[2]{"o point seventy-five","0.75"};
			numerals[152] = new string[2]{"one point nought two","1.02"};
			numerals[153] = new string[2]{"three point forty-five","3.45"};
			numerals[154] = new string[2]{"four point twenty-five","4.25"};
			numerals[155] = new string[2]{"thirty-four point seventy-five","34.75"};
			numerals[156] = new string[2]{"","БОЛЬШОЕ ЧИСЛА"};
			numerals[157] = new string[2]{"million","10 в 6"};
			numerals[158] = new string[2]{"milliard","10 в 9"};
			numerals[159] = new string[2]{"billion","10 в 12"};
			numerals[160] = new string[2]{"trillion","10 в 18"};
			numerals[161] = new string[2]{"quadrillion","10 в 24"};
			numerals[162] = new string[2]{"quintillion","10 в 30"};
			numerals[163] = new string[2]{"sextillion","10 в 36"};
			numerals[164] = new string[2]{"septillion","10 в 42"};
			numerals[165] = new string[2]{"octillion","10 в 48"};
			numerals[166] = new string[2]{"nonillion","10 в 54"};
			numerals[167] = new string[2]{"decillion","10 в 60"};
			numerals[168] = new string[2]{"googol","10 в 100"};
			numerals[169] = new string[2]{"centillion","10 в 600"};


			foreach(string[] values in numerals)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Numeral (Numeral_English, Numeral_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Numeral.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/*
		 * Таблица: Наречие
		 * 01. ID - идентификатор
		 * 02. Adverb_English - наречие на английском
		 * 03. Adverb_Translation - перевод на русский
		 */
		void tableAdverb()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE Adverb (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[Adverb_English] VARCHAR DEFAULT '', " +
				"[Adverb_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Adverb.", false, true);
				Application.Exit();
			}
			
			string[][] adverb = new string[97][];
			adverb[0] = new string[2]{"","НАРЕЧИЯ ВРЕМЕНИ"};
			adverb[1] = new string[2]{"already","уже"};
			adverb[2] = new string[2]{"always","всегда"};
			adverb[3] = new string[2]{"at night","ночью"};
			adverb[4] = new string[2]{"before","раньше"};
			adverb[5] = new string[2]{"ever","когда-либо"};
			adverb[6] = new string[2]{"just","только что"};
			adverb[7] = new string[2]{"never","никогда"};
			adverb[8] = new string[2]{"now","сейчас"};
			adverb[9] = new string[2]{"often","часто"};
			adverb[10] = new string[2]{"rarely","редко"};
			adverb[11] = new string[2]{"seldom","редко"};
			adverb[12] = new string[2]{"sometimes","иногда"};
			adverb[13] = new string[2]{"still","всё ещё"};
			adverb[14] = new string[2]{"then","тогда"};
			adverb[15] = new string[2]{"today","сегодня"};
			adverb[16] = new string[2]{"tomorrow","завтра"};
			adverb[17] = new string[2]{"usually","обычно"};
			adverb[18] = new string[2]{"yesterday","вчера"};
			adverb[19] = new string[2]{"yet","еще, уже"};
			adverb[20] = new string[2]{"","НАРЕЧИЯ МЕСТА"};
			adverb[21] = new string[2]{"anywhere","где-нибудь, куда-нибудь"};
			adverb[22] = new string[2]{"down","внизу, вниз"};
			adverb[23] = new string[2]{"everywhere","везде"};
			adverb[24] = new string[2]{"northward","к северу, на север"};
			adverb[25] = new string[2]{"nowhere","нигде, никогда"};
			adverb[26] = new string[2]{"outside","снаружи, наружу"};
			adverb[27] = new string[2]{"somewhere","где-то, где-нибудь, куда-нибудь"};
			adverb[28] = new string[2]{"southward","к югу, на юг"};
			adverb[29] = new string[2]{"up","наверху, наверх"};
			adverb[30] = new string[2]{"within","внутри"};
			adverb[31] = new string[2]{"","НАРЕЧИЯ ДЕЙСТВИЯ"};
			adverb[32] = new string[2]{"attentively","внимательно"};
			adverb[33] = new string[2]{"brightly","ярко"};
			adverb[34] = new string[2]{"carefully","осторожно"};
			adverb[35] = new string[2]{"deep","глубако"};
			adverb[36] = new string[2]{"distinctly","отчётливо"};
			adverb[37] = new string[2]{"early","равно"};
			adverb[38] = new string[2]{"fast","быстро; прочно, крепко"};
			adverb[39] = new string[2]{"hard","упорно"};
			adverb[40] = new string[2]{"hardly","с трудом"};
			adverb[41] = new string[2]{"high","высоко"};
			adverb[42] = new string[2]{"late","поздно"};
			adverb[43] = new string[2]{"long","долго"};
			adverb[44] = new string[2]{"low","низко"};
			adverb[45] = new string[2]{"near","близко"};
			adverb[46] = new string[2]{"quickly","быстро"};
			adverb[47] = new string[2]{"quietly","спокойно"};
			adverb[48] = new string[2]{"right","правильно"};
			adverb[49] = new string[2]{"seriously","серьёзно"};
			adverb[50] = new string[2]{"slowly","медленно"};
			adverb[51] = new string[2]{"straight","прямо"};
			adverb[52] = new string[2]{"well","хорошо"};
			adverb[53] = new string[2]{"wrong","неправильно"};
			adverb[54] = new string[2]{"","НАРЕЧИЯ МЕРЫ И СТЕПЕНИ"};
			adverb[55] = new string[2]{"almost","почти"};
			adverb[56] = new string[2]{"enough","довольно"};
			adverb[57] = new string[2]{"just","только, как раз"};
			adverb[58] = new string[2]{"little","мало"};
			adverb[59] = new string[2]{"much","много, значительно"};
			adverb[60] = new string[2]{"nearly","почти"};
			adverb[61] = new string[2]{"quite","вполне"};
			adverb[62] = new string[2]{"rather","довольно"};
			adverb[63] = new string[2]{"scarcely","едва"};
			adverb[64] = new string[2]{"too","слишком"};
			adverb[65] = new string[2]{"very","очень"};
			adverb[66] = new string[2]{"","КАЧЕСТВЕННЫЕ НАРЕЧИЯ"};
			adverb[67] = new string[2]{"fast","быстро (односложные наречия)"};
			adverb[68] = new string[2]{"faster","быстрее"};
			adverb[69] = new string[2]{"fastest","самый быстрый"};
			adverb[70] = new string[2]{"early","рано (изменение конечной -y)"};
			adverb[71] = new string[2]{"earlier","ранее"};
			adverb[72] = new string[2]{"earliest","самый ранний"};
			adverb[73] = new string[2]{"rarely","редко (большинство двусложных и все многосложные)"};
			adverb[74] = new string[2]{"more rarely","более редко"};
			adverb[75] = new string[2]{"most rarely","наиболее редко"};
			adverb[76] = new string[2]{"attentively","внимательно (большинство двусложных и все многосложные)"};
			adverb[77] = new string[2]{"more attentively","более внимательно"};
			adverb[78] = new string[2]{"most attentively","наиболее внимательно"};
			adverb[79] = new string[2]{"","ОСОБЫЕ ФОРМЫ"};
			adverb[80] = new string[2]{"badly","плохо"};
			adverb[81] = new string[2]{"worse","хуже (сравнительная степень)"};
			adverb[82] = new string[2]{"worst","хуже всего (превосходная степень)"};
			adverb[83] = new string[2]{"far","далеко"};
			adverb[84] = new string[2]{"farther","дальше (сравнительная степень)"};
			adverb[85] = new string[2]{"further","дальше (сравнительная степень)"};
			adverb[86] = new string[2]{"farthest","дальше всего (превосходная степень)"};
			adverb[87] = new string[2]{"furthest","дальше всего (превосходная степень)"};
			adverb[88] = new string[2]{"little","мало"};
			adverb[89] = new string[2]{"less","меньше (сравнительная степень)"};
			adverb[90] = new string[2]{"least","меньше всего (превосходная степень)"};
			adverb[91] = new string[2]{"many","много"};
			adverb[92] = new string[2]{"more","больше (сравнительная степень)"};
			adverb[93] = new string[2]{"most","больше всего (превосходная степень)"};
			adverb[94] = new string[2]{"well","хорошо"};
			adverb[95] = new string[2]{"better","лучше (сравнительная степень)"};
			adverb[96] = new string[2]{"best","лучше всего (превосходная степень)"};

			foreach(string[] values in adverb)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Adverb (Adverb_English, Adverb_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Adverb.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/*
		 * Таблица: Условное наклонение
		 * 01. ID - идентификатор
		 * 02. Condition_English - условие на английском
		 * 03. Condition_Translation - перевод на русский
		 */
		void tableConditions()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE Conditions (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[Condition_English] VARCHAR DEFAULT '', " +
				"[Condition_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Conditions.", false, true);
				Application.Exit();
			}
			
			string[][] сonditions = new string[3][];
			сonditions[0] = new string[2]{"if {Present Simple} will do","Реальное условие (предполагаемые действия, относящиеся к будущему времени)"};
			сonditions[1] = new string[2]{"if {Past Simple} would do","Нереальное условие (действия, которые вряд ли произойдут)"};
			сonditions[2] = new string[2]{"if {Past Perfect} would have done","Нереальное условие (действия, предполагаемые в прошлом, но которые не произошли)"};

			foreach(string[] values in сonditions)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Conditions (Condition_English, Condition_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Conditions.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/*
		 * Таблица: Предлог
		 * 01. ID - идентификатор
		 * 02. Preposition_English - предлог на английском
		 * 03. Preposition_Translation - перевод на русский
		 */
		void tablePreposition()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE Preposition (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[Preposition_English] VARCHAR DEFAULT '', " +
				"[Preposition_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Preposition.", false, true);
				Application.Exit();
			}
			
			string[][] preposition = new string[47][];
			preposition[0] = new string[2]{"","ПРОСТЫЕ"};
			preposition[1] = new string[2]{"at","в, на, у, при"};
			preposition[2] = new string[2]{"by","у, около, возле, мимо, вдоль, путем, посредством к, за, до, по, на"};
			preposition[3] = new string[2]{"for","для, ради"};
			preposition[4] = new string[2]{"from","из, с"};
			preposition[5] = new string[2]{"in","в, на"};
			preposition[6] = new string[2]{"of","предлог родительного падежа"};
			preposition[7] = new string[2]{"on","на, о, по"};
			preposition[8] = new string[2]{"to","в, к, для, до, на, по"};
			preposition[9] = new string[2]{"with","с, у"};
			preposition[10] = new string[2]{"","СЛОЖНЫЕ"};
			preposition[11] = new string[2]{"inside","внутри"};
			preposition[12] = new string[2]{"into","в"};
			preposition[13] = new string[2]{"outside","вне, снаружи"};
			preposition[14] = new string[2]{"throughout","через"};
			preposition[15] = new string[2]{"upon","на"};
			preposition[16] = new string[2]{"","СОСТАВНЫЕ"};
			preposition[17] = new string[2]{"according to","согласно"};
			preposition[18] = new string[2]{"as compared with","по сравнению с"};
			preposition[19] = new string[2]{"as far as","до"};
			preposition[20] = new string[2]{"as for","что касается"};
			preposition[21] = new string[2]{"as to","что касается"};
			preposition[22] = new string[2]{"because of","из-за"};
			preposition[23] = new string[2]{"by force of","в силу"};
			preposition[24] = new string[2]{"by means of","посредством"};
			preposition[25] = new string[2]{"by virtue of","посредством"};
			preposition[26] = new string[2]{"contrary to","против"};
			preposition[27] = new string[2]{"due to","благодаря"};
			preposition[28] = new string[2]{"for the sake of","ради, чтобы"};
			preposition[29] = new string[2]{"in accordance with","в соответствии с"};
			preposition[30] = new string[2]{"in addition to","в дополнение"};
			preposition[31] = new string[2]{"in case of","в случае"};
			preposition[32] = new string[2]{"in connection with","в связи"};
			preposition[33] = new string[2]{"in consequence of","вследствие"};
			preposition[34] = new string[2]{"in front of","перед"};
			preposition[35] = new string[2]{"in spite of","не смотря на"};
			preposition[36] = new string[2]{"in the course of","в течение"};
			preposition[37] = new string[2]{"in the event of","в случае"};
			preposition[38] = new string[2]{"in view of","ввиду"};
			preposition[39] = new string[2]{"instead of","вместо"};
			preposition[40] = new string[2]{"on account of","по причине"};
			preposition[41] = new string[2]{"opposite to","против"};
			preposition[42] = new string[2]{"out of","изнутри"};
			preposition[43] = new string[2]{"owing to","благодаря, из-за"};
			preposition[44] = new string[2]{"thanks to","благодаря"};
			preposition[45] = new string[2]{"with regard to","в отношении"};
			preposition[46] = new string[2]{"with respect to ","в отношении"};
						
			foreach(string[] values in preposition)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Preposition (Preposition_English, Preposition_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Preposition.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/*
		 * Таблица: Союз
		 * 01. ID - идентификатор
		 * 02. Union_English - союз на английском
		 * 03. Union_Translation - перевод на русский
		 */
		void tableUnion()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE Unions (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[Union_English] VARCHAR DEFAULT '', " +
				"[Union_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Unions.", false, true);
				Application.Exit();
			}
			
			string[][] union = new string[73][];
			union[0] = new string[2]{"","ПРОСТЫЕ СОЮЗЫ"};
			union[1] = new string[2]{"and","и, а"};
			union[2] = new string[2]{"but","но"};
			union[3] = new string[2]{"or","или"};
			union[4] = new string[2]{"if","если"};
			union[5] = new string[2]{"that","что"};
			union[6] = new string[2]{"","СЛОЖНЫЕ СОЮЗЫ"};
			union[7] = new string[2]{"ever","когда-либо"};
			union[8] = new string[2]{"however","однако"};
			union[9] = new string[2]{"whenever","тогда как"};
			union[10] = new string[2]{"","СОСТАВНЫЕ СОЮЗЫ"};
			union[11] = new string[2]{"as long as","до тех пор пока"};
			union[12] = new string[2]{"as though","как если бы, будто бы"};
			union[13] = new string[2]{"as well as","так же как"};
			union[14] = new string[2]{"in case","в случае"};
			union[15] = new string[2]{"in order that","для того чтобы"};
			union[16] = new string[2]{"","ПРОТИВИТЕЛЬНЫЕ СОЮЗЫ"};
			union[17] = new string[2]{"and","а"};
			union[18] = new string[2]{"but","но"};
			union[19] = new string[2]{"however","однако; и всё же"};
			union[20] = new string[2]{"yet","однако"};
			union[21] = new string[2]{"","РАЗДЕЛИТЕЛЬНЫЕ СОЮЗЫ"};
			union[22] = new string[2]{"either ... or","или... или; либо... либо; то ли... то ли; не то... не то"};
			union[23] = new string[2]{"for","так как; ибо"};
			union[24] = new string[2]{"or","или"};
			union[25] = new string[2]{"","СОЕДИНИТЕЛЬНЫЕ СОЮЗЫ"};
			union[26] = new string[2]{"and","и"};
			union[27] = new string[2]{"as well as","также, тоже"};
			union[28] = new string[2]{"both ... and","и... и"};
			union[29] = new string[2]{"neither ... nor","ни... ни"};
			union[30] = new string[2]{"nоr","ни"};
			union[31] = new string[2]{"not only ... but (also)","не только... но и"};
			union[32] = new string[2]{"","ВРЕМЕННЫЕ СОЮЗЫ"};
			union[33] = new string[2]{"after","после того как"};
			union[34] = new string[2]{"as","в то время как, тогда"};
			union[35] = new string[2]{"as soon as","как только"};
			union[36] = new string[2]{"as long as","до тех пор пока, пока"};
			union[37] = new string[2]{"before","прежде чем"};
			union[38] = new string[2]{"till","до тех пор пока не"};
			union[39] = new string[2]{"until","до тех пор пока не"};
			union[40] = new string[2]{"when","когда, как (только); после, того как; тогда, когда"};
			union[41] = new string[2]{"where","где"};
			union[42] = new string[2]{"while","пока; в то время как; во время того, как"};
			union[43] = new string[2]{"","ИЗЪЯСНИТЕЛЬНЫЕ СОЮЗЫ"};
			union[44] = new string[2]{"if","если, если бы"};
			union[45] = new string[2]{"that","что; чтобы"};
			union[46] = new string[2]{"whether","ли"};
			union[47] = new string[2]{"","ОБРАЗА ДЕЙСТВИЯ И СРАВНЕНИЯ"};
			union[48] = new string[2]{"as","как"};
			union[49] = new string[2]{"as ... as","как... как"};
			union[50] = new string[2]{"as if","как будто"};
			union[51] = new string[2]{"as though","как будто"};
			union[52] = new string[2]{"so ... as","так... как"};
			union[53] = new string[2]{"not so ... as","не так... как"};
			union[54] = new string[2]{"than","чем"};
			union[55] = new string[2]{"the ... the","чем... тем"};
			union[56] = new string[2]{"","ПРИЧИННЫЕ СОЮЗЫ"};
			union[57] = new string[2]{"as","так как"};
			union[58] = new string[2]{"because","потому что; так как"};
			union[59] = new string[2]{"since","поскольку, с тех пор как"};
			union[60] = new string[2]{"so that","для того чтобы"};
			union[61] = new string[2]{"","УСЛОВНЫЕ СОЮЗЫ"};
			union[62] = new string[2]{"if","если"};
			union[63] = new string[2]{"provided (that)","при условии, что; если"};
			union[64] = new string[2]{"unless","если (только) не; пока не; разве (только)"};
			union[65] = new string[2]{"","УСТАПИТЕЛЬНЫЕ СОЮЗЫ"};
			union[66] = new string[2]{"although","хотя; несмотря на то, что"};
			union[67] = new string[2]{"though","хотя, хоть; несмотря на то, что..."};
			union[68] = new string[2]{"","ЦЕЛЕВЫЕ СОЮЗЫ"};
			union[69] = new string[2]{"in order that","чтобы"};
			union[70] = new string[2]{"lest","чтобы не; как бы не"};
			union[71] = new string[2]{"so that","чтобы"};
			union[72] = new string[2]{"that","чтобы"};
						
			foreach(string[] values in union)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Unions (Union_English, Union_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Unions.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/*
		 * Таблица: Частицы
		 * 01. ID - идентификатор
		 * 02. Particle_English - частица на английском
		 * 03. Particle_Translation - перевод на русский
		 */
		void tableParticles()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE Particles (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[Particle_English] VARCHAR DEFAULT '', " +
				"[Particle_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Particles.", false, true);
				Application.Exit();
			}
			
			string[][] particles = new string[19][];
			particles[0] = new string[2]{"","ВЫДЕЛИТЕЛЬНО-ОГРАНИЧИТЕЛЬНЫЕ"};
			particles[1] = new string[2]{"even","даже"};
			particles[2] = new string[2]{"only","только"};
			particles[3] = new string[2]{"merely","только, просто"};
			particles[4] = new string[2]{"just","только, лишь, просто"};
			particles[5] = new string[2]{"alone","только"};
			particles[6] = new string[2]{"","УСИЛИТЕЛЬНЫЕ"};
			particles[7] = new string[2]{"even","даже"};
			particles[8] = new string[2]{"yet","ещё"};
			particles[9] = new string[2]{"still","ещё"};
			particles[10] = new string[2]{"just","как, раз, именно"};
			particles[11] = new string[2]{"simply","просто"};
			particles[12] = new string[2]{"never","так и не"};
			particles[13] = new string[2]{"","УТОЧНИТЕЛЬНЫЕ"};
			particles[14] = new string[2]{"just","именно, как раз, точно, ровно"};
			particles[15] = new string[2]{"right","именно, как раз, точно, ровно"};
			particles[16] = new string[2]{"exactly","именно, как раз, точно, ровно"};
			particles[17] = new string[2]{"precisely","именно, как раз, точно, ровно"};
			particles[18] = new string[2]{"not","не"};
			
			foreach(string[] values in particles)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Particles (Particle_English, Particle_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Particles.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/*
		 * Таблица: Модальные слова
		 * 01. ID - идентификатор
		 * 02. ModalWord_English - модальное слово на английском
		 * 03. ModalWord_Translation - перевод на русский
		 */
		void tableModalWords()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE ModalWords (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[ModalWord_English] VARCHAR DEFAULT '', " +
				"[ModalWord_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы ModalWords.", false, true);
				Application.Exit();
			}
			
			string[][] particles = new string[46][];
			particles[0] = new string[2]{"perhaps","вероятно"};
			particles[1] = new string[2]{"maybe","может быть"};
			particles[2] = new string[2]{"of course","конечно"};
			particles[3] = new string[2]{"surely","конечно"};
			particles[4] = new string[2]{"no doubt","несомненно"};
			particles[5] = new string[2]{"in fact","фактически"};
			particles[6] = new string[2]{"in truth","по правде говоря"};
			particles[7] = new string[2]{"possibly","возможно"};
			particles[8] = new string[2]{"рrobably","вероятно"};
			particles[9] = new string[2]{"certainly","конечно"};
			particles[10] = new string[2]{"naturally","само собой разумеется"};
			particles[11] = new string[2]{"evidently","очевидно"};
			particles[12] = new string[2]{"obviously","очевидно"};
			particles[13] = new string[2]{"happily","к счастью"};
			particles[14] = new string[2]{"","НЕОДОБРЕНИЕ"};
			particles[15] = new string[2]{"unfortunately","к несчастью"};
			particles[16] = new string[2]{"unhappily","несчастливо"};
			particles[17] = new string[2]{"unluckily","к несчастью"};
			particles[18] = new string[2]{"","ОДОБРЕНИЕ"};
			particles[19] = new string[2]{"fortunately","к счастью"};
			particles[20] = new string[2]{"happily","счастливо"};
			particles[21] = new string[2]{"luckily","к счастью"};
			particles[22] = new string[2]{"","ОТРИЦАЮЩИЙ ОТВЕТ НА ВОПРОС"};
			particles[23] = new string[2]{"by no means","ни в коем случае"};
			particles[24] = new string[2]{"certainly not","конечно нет"};
			particles[25] = new string[2]{"","ПОДТВЕРЖДАЮЩИЙ ОТВЕТ НА ВОПРОС"};
			particles[26] = new string[2]{"certainly","конечно"};
			particles[27] = new string[2]{"no doubt","без сомнения"};
			particles[28] = new string[2]{"surely","конечно"};
			particles[29] = new string[2]{"yes","да"};
			particles[30] = new string[2]{"yes, indeed","Да, в самом деле"};
			particles[31] = new string[2]{"","СОМНЕНИЕ, ПРЕДПОЛОЖЕНИЕ"};
			particles[32] = new string[2]{"maybe","может быть"};
			particles[33] = new string[2]{"perhaps","возможно"};
			particles[34] = new string[2]{"probably","наверное"};
			particles[35] = new string[2]{"","УВЕРЕННОСТЬ"};
			particles[36] = new string[2]{"naturally","естественно"};
			particles[37] = new string[2]{"no doubt","без сомнения"};
			particles[38] = new string[2]{"of course","конечно"};
			particles[39] = new string[2]{"sure","конечно"};
			particles[40] = new string[2]{"sure enough","конечно же"};
			particles[41] = new string[2]{"surely","конечно"};
			particles[42] = new string[2]{"to be sure","чтобы быть уверенным"};
			particles[43] = new string[2]{"","УСИЛЕНИЕ"};
			particles[44] = new string[2]{"indeed","в самом деле"};
			particles[45] = new string[2]{"really","действительно"};
			
			foreach(string[] values in particles)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO ModalWords (ModalWord_English, ModalWord_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу ModalWords.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		/*
		 * Таблица: Вводные слова
		 * 01. ID - идентификатор
		 * 02. IntroWord_English - вводное слово на английском
		 * 03. IntroWord_Translation - перевод на русский
		 */
		void tableIntroductoryWords()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE IntroductoryWords (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[IntroWord_English] VARCHAR DEFAULT '', " +
				"[IntroWord_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы IntroductoryWords.", false, true);
				Application.Exit();
			}
			
			string[][] particles = new string[15][];
			particles[0] = new string[2]{"","ПОЯСНЕНИЕ ПРИЁМА ИЛИ СУЩНОСТИ ВЫСКАЗЫВАНИЯ"};
			particles[1] = new string[2]{"after all","в конце концов"};
			particles[2] = new string[2]{"at any rate","во всяком случае"};
			particles[3] = new string[2]{"by the way","кстати"};
			particles[4] = new string[2]{"in a word","одним словом"};
			particles[5] = new string[2]{"in other words","другими словами"};
			particles[6] = new string[2]{"so to say","так сказать"};
			particles[7] = new string[2]{"so to speak","так сказать"};
			particles[8] = new string[2]{"talking of..","говоря о..."};
			particles[9] = new string[2]{"to tell the truth","по правде говоря"};
			particles[10] = new string[2]{"to begin with","прежде всего"};
			particles[11] = new string[2]{"","ВЫРАЖЕНИЯ СУБЪЕКТИВНОГО ОТНОШЕНИЯ ГОВОРЯЩЕГО К ВЫСКАЗЫВАЕМОЙ МЫСЛИ"};
			particles[12] = new string[2]{"I’m sure","я уверен"};
			particles[13] = new string[2]{"I suppose","я предпологаю"};
			particles[14] = new string[2]{"frankly speaking","честно говоря"};
			
			foreach(string[] values in particles)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO IntroductoryWords (IntroWord_English, IntroWord_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу IntroductoryWords.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
		
		/*
		 * Таблица: Междометия
		 * 01. ID - идентификатор
		 * 02. Interjection_English - междометие на английском
		 * 03. Interjection_Translation - перевод на русский
		 */
		void tableInterjections()
		{
			String sqlCommand;
			QueryOleDb query;
			query = new QueryOleDb(strConnection);
			
			sqlCommand = "CREATE TABLE Interjections (" +
				"[ID] COUNTER PRIMARY KEY, " +
				"[Interjection_English] VARCHAR DEFAULT '', " +
				"[Interjection_Translation] VARCHAR DEFAULT ''" +
				")";
			query.SetCommand(sqlCommand);
			if(!query.Execute()) {
				Utilits.Console.LogError("Ошибка создания таблицы Interjections.", false, true);
				Application.Exit();
			}
			
			string[][] particles = new string[45][];
			particles[0] = new string[2]{"ah","ах! а!"};
			particles[1] = new string[2]{"aha","ага!"};
			particles[2] = new string[2]{"ahem","гм!"};
			particles[3] = new string[2]{"alas","увы!"};
			particles[4] = new string[2]{"bah","ба!"};
			particles[5] = new string[2]{"bang","бац!"};
			particles[6] = new string[2]{"blimey","чтоб мне провалиться! иди ты!"};
			particles[7] = new string[2]{"cheerio","за ваше здоровье! всего хорошего! здорово! привет!"};
			particles[8] = new string[2]{"eh","а? как? вот как! не правда ли?"};
			particles[9] = new string[2]{"faugh","тьфу! фу!"};
			particles[10] = new string[2]{"fie","фу! тьфу!"};
			particles[11] = new string[2]{"fudge","чепуха! вздор!"};
			particles[12] = new string[2]{"gad","ну? да ну!; вот так так!"};
			particles[13] = new string[2]{"gee","вот так так! вот здорово!"};
			particles[14] = new string[2]{"hallo(a)","алло! привет!"};
			particles[15] = new string[2]{"halloo","ату! эй!"};
			particles[16] = new string[2]{"hey","эй!"};
			particles[17] = new string[2]{"hollo(a)","эй!"};
			particles[18] = new string[2]{"hooray","ура!"};
			particles[19] = new string[2]{"hoy","эй"};
			particles[20] = new string[2]{"hullo(a)","алло!"};
			particles[21] = new string[2]{"humph","гм!"};
			particles[22] = new string[2]{"hurra(h)","ура!"};
			particles[23] = new string[2]{"hurray","ура!"};
			particles[24] = new string[2]{"jeez","здорово! чёрт побери!"};
			particles[25] = new string[2]{"lo","вот! смотри! слушай!"};
			particles[26] = new string[2]{"mum","тише! тс!"};
			particles[27] = new string[2]{"oho","ого!"};
			particles[28] = new string[2]{"ooh","ах! ух!"};
			particles[29] = new string[2]{"oops","хоп! ой! ух! ох!"};
			particles[30] = new string[2]{"ouch","ай! ой!"};
			particles[31] = new string[2]{"pah","тьфу! фу!"};
			particles[32] = new string[2]{"phew","фу! ну и ну!"};
			particles[33] = new string[2]{"pish","тьфу! фи!"};
			particles[34] = new string[2]{"pooh","уф! тьфу!"};
			particles[35] = new string[2]{"righto","хорошо! ладно! согласен!"};
			particles[36] = new string[2]{"tush","фу! тьфу!"};
			particles[37] = new string[2]{"tut","ах ты!"};
			particles[38] = new string[2]{"tut-tut","вот ещё! ещё чего не хватало!"};
			particles[39] = new string[2]{"ugh","тьфу! ах!"};
			particles[40] = new string[2]{"wakey","вставай! подъём!"};
			particles[41] = new string[2]{"well","ну!"};
			particles[42] = new string[2]{"whew","вот так так!"};
			particles[43] = new string[2]{"yah","да ну?"};
			particles[44] = new string[2]{"yum-yum","ням-ням"};
			
			foreach(string[] values in particles)
			{
				if(values == null) continue;
				sqlCommand = "INSERT INTO Interjections (Interjection_English, Interjection_Translation) " +
					"VALUES " + 
					"('"+values[0]+"', '"+values[1]+"')";
				query.SetCommand(sqlCommand);
				if(!query.Execute()){
					Utilits.Console.LogError("Ошибка добавления данных в таблицу Interjections.", false, true);
					Application.Exit();
				}
			}
			
			query.Dispose();
		}
		
	}
}
